[Killed] Identical
Controller/ClientLoginController.php:36:9
 
     public function dataConstruct(): TemplateEngine
     {
-        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
+        if ($_SERVER['REQUEST_METHOD'] !== 'POST') {
             $this->clientDTO->email = $_POST['mail'] ?? '';
             $this->clientDTO->password = $_POST['password'] ?? '';
killedBy: Controller\ClientLoginControllerTest::testDataConstructInvalidRequestMethod
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructInvalidRequestMethod
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'feedback' => '',
+    'feedback' => 'not a valid combination',

[Killed] Coalesce
Controller/ClientLoginController.php:37:13
     public function dataConstruct(): TemplateEngine
     {
         if ($_SERVER['REQUEST_METHOD'] === 'POST') {
-            $this->clientDTO->email = $_POST['mail'] ?? '';
+            $this->clientDTO->email = '' ?? $_POST['mail'];
             $this->clientDTO->password = $_POST['password'] ?? '';
 
killedBy: Controller\ClientLoginControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''

[Killed] Coalesce
Controller/ClientLoginController.php:38:13
     {
         if ($_SERVER['REQUEST_METHOD'] === 'POST') {
             $this->clientDTO->email = $_POST['mail'] ?? '';
-            $this->clientDTO->password = $_POST['password'] ?? '';
+            $this->clientDTO->password = '' ?? $_POST['password'];
 
             $verify = (
killedBy: Controller\ClientLoginControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''

[Killed] Identical
Controller/ClientLoginController.php:42:13
 
             $verify = (
             $this->clientRepository->checkLoginCredentials($this->clientDTO));
-            if ($verify === true) {
+            if ($verify !== true) {
                 $this->sessionHandler->setSession($_POST['mail']);
                 $feedback = 'success';
killedBy: Controller\ClientLoginControllerTest::testDataConstructInvalidCombination
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''

[Killed] TrueValue
Controller/ClientLoginController.php:42:13
 
             $verify = (
             $this->clientRepository->checkLoginCredentials($this->clientDTO));
-            if ($verify === true) {
+            if ($verify === false) {
                 $this->sessionHandler->setSession($_POST['mail']);
                 $feedback = 'success';
killedBy: Controller\ClientLoginControllerTest::testDataConstructInvalidCombination
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''

[Survived] MethodCallRemoval
Controller/ClientLoginController.php:43:17
             $verify = (
             $this->clientRepository->checkLoginCredentials($this->clientDTO));
             if ($verify === true) {
-                $this->sessionHandler->setSession($_POST['mail']);
+                
                 $feedback = 'success';
                 $this->redirect->to('?page=shop');

[Killed] MethodCallRemoval
Controller/ClientLoginController.php:45:17
             if ($verify === true) {
                 $this->sessionHandler->setSession($_POST['mail']);
                 $feedback = 'success';
-                $this->redirect->to('?page=shop');
+                
             } else {
                 $feedback = 'not a valid combination';
killedBy: Controller\ClientLoginControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''

[Killed] MethodCallRemoval
Controller/ClientLoginController.php:50:9
                 $feedback = 'not a valid combination';
             }
         }
-        $this->templateEngine->setTemplate('login.twig');
+        
         $this->templateEngine->addParameter('feedback', $feedback ?? '');
 
killedBy: Controller\ClientLoginControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLoginControllerTest.php:53

ERRORS!
Tests: 3, Assertions: 4, Errors: 1.

[Killed] MethodCallRemoval
Controller/ClientLoginController.php:51:9
             }
         }
         $this->templateEngine->setTemplate('login.twig');
-        $this->templateEngine->addParameter('feedback', $feedback ?? '');
+        
 
         return $this->templateEngine;
killedBy: Controller\ClientLoginControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructValid
Error: Typed property App\Core\TemplateEngine::$parameters must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:38
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLoginControllerTest.php:52

2) Controller\ClientLoginControllerTest::testDataConstructInval

[Killed] Coalesce
Controller/ClientLoginController.php:51:9
             }
         }
         $this->templateEngine->setTemplate('login.twig');
-        $this->templateEngine->addParameter('feedback', $feedback ?? '');
+        $this->templateEngine->addParameter('feedback', '' ?? $feedback);
 
         return $this->templateEngine;
killedBy: Controller\ClientLoginControllerTest::testDataConstructInvalidCombination
statusReason: 1) Controller\ClientLoginControllerTest::testDataConstructInvalidCombination
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'feedback' => 'not a valid combination',
+    'feedback' => '',
