[Killed] Coalesce
Controller/BasketController.php:29:9
 
     public function dataConstruct() : TemplateEngine
     {
-        $action = $_GET['action'] ?? '';
+        $action = '' ?? $_GET['action'];
 
         $actionMap = [
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Controller\BasketControllerTest::testDataConstructRemove
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:81

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ArrayItemRemoval
Controller/BasketController.php:31:9
     {
         $action = $_GET['action'] ?? '';
 
-        $actionMap = [
-            'add' => 'addItemToBasket',
-            'remove' => 'removeItemFromBasket'
-        ];
+        $actionMap = ['remove' => 'removeItemFromBasket'];
 
         if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Controller/BasketController.php:36:9
             'remove' => 'removeItemFromBasket'
         ];
 
-        if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
+        if (empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
             $this->manipulator->{$actionMap[$action]}();
         }
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] LogicalAndSingleSubExprNegation
Controller/BasketController.php:36:9
             'remove' => 'removeItemFromBasket'
         ];
 
-        if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
+        if (!empty($this->sessionHandler->getSessionMail()) && !array_key_exists($action, $actionMap)) {
             $this->manipulator->{$actionMap[$action]}();
         }
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/BasketController.php:37:13
         ];
 
         if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
-            $this->manipulator->{$actionMap[$action]}();
+            
         }
 
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/BasketController.php:43:9
         $basketContent = $this->basketRepository->getBasketInfo();
         $total = $this->basketRepository->getBasketTotal();
 
-        $this->templateEngine->addParameter('contents', $basketContent);
+        
         $this->templateEngine->addParameter('total', $total);
         $this->templateEngine->setTemplate('basket.twig');
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 2.

[Killed] MethodCallRemoval
Controller/BasketController.php:44:9
         $total = $this->basketRepository->getBasketTotal();
 
         $this->templateEngine->addParameter('contents', $basketContent);
-        $this->templateEngine->addParameter('total', $total);
+        
         $this->templateEngine->setTemplate('basket.twig');
 
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is identical to '149.95'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:66

FAILURES!
Tests: 1, Assertions: 4, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/BasketController.php:45:9
 
         $this->templateEngine->addParameter('contents', $basketContent);
         $this->templateEngine->addParameter('total', $total);
-        $this->templateEngine->setTemplate('basket.twig');
+        
 
         return $this->templateEngine;
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Controller\BasketControllerTest::testDataConstructRemove
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:79

2) Controller\BasketControllerTest::testDataConstructAdd
Error: Typed property
