[Survived] MethodCallRemoval
Controller/CheckoutController.php:30:9
     public function dataConstruct(): TemplateEngine
     {
         $errorDTOList = $this->billingValidator->validate($this->orderRepository->getOrderInformation());
-        $this->billingValidator->redirectIfValid($errorDTOList);
+        
 
         $basket = $this->basketRepository->getBasketInfo();

[Killed] MethodCallRemoval
Controller/CheckoutController.php:36:9
         $total = $this->basketRepository->getBasketTotal();
         $values = $this->orderRepository->getOrderInformation();
 
-        $this->templateEngine->setTemplate('checkout.twig');
+        
         $this->templateEngine->addParameter('errors', $errorDTOList);
         $this->templateEngine->addParameter('values', $values);
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:45

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] MethodCallRemoval
Controller/CheckoutController.php:37:9
         $values = $this->orderRepository->getOrderInformation();
 
         $this->templateEngine->setTemplate('checkout.twig');
-        $this->templateEngine->addParameter('errors', $errorDTOList);
+        
         $this->templateEngine->addParameter('values', $values);
         $this->templateEngine->addParameter('basket', $basket);

[Survived] MethodCallRemoval
Controller/CheckoutController.php:38:9
 
         $this->templateEngine->setTemplate('checkout.twig');
         $this->templateEngine->addParameter('errors', $errorDTOList);
-        $this->templateEngine->addParameter('values', $values);
+        
         $this->templateEngine->addParameter('basket', $basket);
         $this->templateEngine->addParameter('total', $total);

[Survived] MethodCallRemoval
Controller/CheckoutController.php:39:9
         $this->templateEngine->setTemplate('checkout.twig');
         $this->templateEngine->addParameter('errors', $errorDTOList);
         $this->templateEngine->addParameter('values', $values);
-        $this->templateEngine->addParameter('basket', $basket);
+        
         $this->templateEngine->addParameter('total', $total);
 

[Survived] MethodCallRemoval
Controller/CheckoutController.php:40:9
         $this->templateEngine->addParameter('errors', $errorDTOList);
         $this->templateEngine->addParameter('values', $values);
         $this->templateEngine->addParameter('basket', $basket);
-        $this->templateEngine->addParameter('total', $total);
+        
 
         return $this->templateEngine;
