[Killed] MethodCallRemoval
Controller/ClientLogoutController.php:24:9
 
     public function dataConstruct(): void
     {
-        $this->sessionHandler->unsetSession();
+        
         $this->redirect->to('?page=shop');
     }
killedBy: Controller\ClientLogoutControllerTest::testDataConstruct
statusReason: 1) Controller\ClientLogoutControllerTest::testDataConstruct
Failed asserting that two strings are not identical.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLogoutControllerTest.php:43

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/ClientLogoutController.php:25:9
     public function dataConstruct(): void
     {
         $this->sessionHandler->unsetSession();
-        $this->redirect->to('?page=shop');
+        
     }
 }
killedBy: Controller\ClientLogoutControllerTest::testDataConstruct
statusReason: 1) Controller\ClientLogoutControllerTest::testDataConstruct
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop'
+''
