[Killed] Coalesce
Controller/ClientRegistrationController.php:32:9
     public function dataConstruct(): TemplateEngine
     {
         $clientDTO = new ClientDTO();
-        $clientDTO->username = ($_POST['name'] ?? '');
+        $clientDTO->username = '' ?? $_POST['name'];
         $clientDTO->email = ($_POST['mail'] ?? '');
         $clientDTO->password = ($_POST['password'] ?? '');
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidName
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidName
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'INVALID-NAME(!123)'
+''

[Killed] Coalesce
Controller/ClientRegistrationController.php:33:9
     {
         $clientDTO = new ClientDTO();
         $clientDTO->username = ($_POST['name'] ?? '');
-        $clientDTO->email = ($_POST['mail'] ?? '');
+        $clientDTO->email = '' ?? $_POST['mail'];
         $clientDTO->password = ($_POST['password'] ?? '');
         $this->errorDTOList = [];
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'TEST@TEST.com'
+''

[Killed] Coalesce
Controller/ClientRegistrationController.php:34:9
         $clientDTO = new ClientDTO();
         $clientDTO->username = ($_POST['name'] ?? '');
         $clientDTO->email = ($_POST['mail'] ?? '');
-        $clientDTO->password = ($_POST['password'] ?? '');
+        $clientDTO->password = '' ?? $_POST['password'];
         $this->errorDTOList = [];
 
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructEmailNotUnique
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructEmailNotUnique
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your email is already registered!'
+'Oops, your password doesn't look right!'

[Killed] Identical
Controller/ClientRegistrationController.php:37:9
         $clientDTO->password = ($_POST['password'] ?? '');
         $this->errorDTOList = [];
 
-        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
+        if ($_SERVER['REQUEST_METHOD'] !== 'POST') {
 
             $validator = $this->validator;
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmail
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmail
Failed asserting that null is identical to 'Oops, your email doesn't look right'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:78

FAILURES!
Tests: 1, Assertions: 4, Failures: 1, Warnings: 2.

[Survived] Coalesce
Controller/ClientRegistrationController.php:46:17
                 $validPassword = password_hash(password: $clientDTO->password, algo: PASSWORD_DEFAULT);
 
                 $newUser = new ClientDTO();
-                $newUser->username = ($clientDTO->username ?? '');
+                $newUser->username = '' ?? $clientDTO->username;
                 $newUser->email = ($clientDTO->email ?? '');
                 $newUser->password = ($validPassword);

[Survived] Coalesce
Controller/ClientRegistrationController.php:47:17
 
                 $newUser = new ClientDTO();
                 $newUser->username = ($clientDTO->username ?? '');
-                $newUser->email = ($clientDTO->email ?? '');
+                $newUser->email = '' ?? $clientDTO->email;
                 $newUser->password = ($validPassword);
 

[Killed] LogicalNot
Controller/ClientRegistrationController.php:50:17
                 $newUser->email = ($clientDTO->email ?? '');
                 $newUser->password = ($validPassword);
 
-                if (empty($this->clientRepository->findByMail($clientDTO->email) && !empty($clientDTO->password))) {
+                if (empty($this->clientRepository->findByMail($clientDTO->email) && empty($clientDTO->password))) {
                     $this->clientEntityManager->saveCredentials($newUser);
                     $this->errorDTOList [] = new ErrorDTO('Success. Welcome abroad!');
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructEmailNotUnique
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructEmailNotUnique
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'TEST'
+''

[Killed] LogicalAnd
Controller/ClientRegistrationController.php:50:17
                 $newUser->email = ($clientDTO->email ?? '');
                 $newUser->password = ($validPassword);
 
-                if (empty($this->clientRepository->findByMail($clientDTO->email) && !empty($clientDTO->password))) {
+                if (empty($this->clientRepository->findByMail($clientDTO->email) || !empty($clientDTO->password))) {
                     $this->clientEntityManager->saveCredentials($newUser);
                     $this->errorDTOList [] = new ErrorDTO('Success. Welcome abroad!');
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructValid
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-''
+'TESTING'

[Survived] MethodCallRemoval
Controller/ClientRegistrationController.php:51:21
                 $newUser->password = ($validPassword);
 
                 if (empty($this->clientRepository->findByMail($clientDTO->email) && !empty($clientDTO->password))) {
-                    $this->clientEntityManager->saveCredentials($newUser);
+                    
                     $this->errorDTOList [] = new ErrorDTO('Success. Welcome abroad!');
                     $clientDTO->username = ('');

[Killed] MethodCallRemoval
Controller/ClientRegistrationController.php:61:9
                 }
             }
         }
-        $this->templateEngine->setTemplate('registration.twig');
+        
         $this->templateEngine->addParameter('user', $clientDTO);
         $this->templateEngine->addParameter('vName', $clientDTO->username);
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidPasswort
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:118

2) Controller\ClientRegistratio

[Survived] MethodCallRemoval
Controller/ClientRegistrationController.php:62:9
             }
         }
         $this->templateEngine->setTemplate('registration.twig');
-        $this->templateEngine->addParameter('user', $clientDTO);
+        
         $this->templateEngine->addParameter('vName', $clientDTO->username);
         $this->templateEngine->addParameter('vMail', $clientDTO->email);

[Killed] MethodCallRemoval
Controller/ClientRegistrationController.php:63:9
         }
         $this->templateEngine->setTemplate('registration.twig');
         $this->templateEngine->addParameter('user', $clientDTO);
-        $this->templateEngine->addParameter('vName', $clientDTO->username);
+        
         $this->templateEngine->addParameter('vMail', $clientDTO->email);
         $this->templateEngine->addParameter('errors', $this->errorDTOList);
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmail
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmail
Failed asserting that null is identical to 'TEST'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:76

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/ClientRegistrationController.php:64:9
         $this->templateEngine->setTemplate('registration.twig');
         $this->templateEngine->addParameter('user', $clientDTO);
         $this->templateEngine->addParameter('vName', $clientDTO->username);
-        $this->templateEngine->addParameter('vMail', $clientDTO->email);
+        
         $this->templateEngine->addParameter('errors', $this->errorDTOList);
 
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
Failed asserting that null is identical to 'TEST@TEST.com'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:91

FAILURES!
Tests: 1, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/ClientRegistrationController.php:65:9
         $this->templateEngine->addParameter('user', $clientDTO);
         $this->templateEngine->addParameter('vName', $clientDTO->username);
         $this->templateEngine->addParameter('vMail', $clientDTO->email);
-        $this->templateEngine->addParameter('errors', $this->errorDTOList);
+        
 
         return $this->templateEngine;
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
Failed asserting that null is identical to 'Oops, your name doesn't look right'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:106

FAILURES!
Tests: 1, Assertions: 4, Failures: 1, Warnings: 3.
