[Survived] MethodCallRemoval
Controller/HomepageController.php:27:9
 
     public function dataConstruct() : TemplateEngine
     {
-        $this->searchEngine->search();
+        
 
         $teamID = $_GET['id'] ?? null;

[Killed] MethodCallRemoval
Controller/HomepageController.php:35:9
 
         $players = $this->playerRepository->getPlayers($teamID);
 
-        $this->templateEngine->addParameter('user', $user);
+        
         $this->templateEngine->addParameter('players', $players);
         $this->templateEngine->setTemplate('homepage.twig');
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Failed asserting that null is identical to 'TEST@TEST.com'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:79

FAILURES!
Tests: 1, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/HomepageController.php:36:9
         $players = $this->playerRepository->getPlayers($teamID);
 
         $this->templateEngine->addParameter('user', $user);
-        $this->templateEngine->addParameter('players', $players);
+        
         $this->templateEngine->setTemplate('homepage.twig');
 
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Failed asserting that a NULL is not empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:77

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/HomepageController.php:37:9
 
         $this->templateEngine->addParameter('user', $user);
         $this->templateEngine->addParameter('players', $players);
-        $this->templateEngine->setTemplate('homepage.twig');
+        
 
         return $this->templateEngine;
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:80

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.
