[Killed] MethodCallRemoval
Controller/OrderOverviewController.php:26:9
         $order = $this->orderRepository->getOrderInformation();
         $basket = $this->basketRepository->getBasketInfo();
 
-        $this->templateEngine->addParameter('order', $order);
+        
         $this->templateEngine->addParameter('basket', $basket);
         $this->templateEngine->setTemplate('orderoverview.twig');
killedBy: Controller\OrderOverviewControllerTest::testDataConstruct
statusReason: 1) Controller\OrderOverviewControllerTest::testDataConstruct
Failed asserting that null is an instance of class App\Core\DTO\OrderDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/OrderOverviewControllerTest.php:75

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/OrderOverviewController.php:27:9
         $basket = $this->basketRepository->getBasketInfo();
 
         $this->templateEngine->addParameter('order', $order);
-        $this->templateEngine->addParameter('basket', $basket);
+        
         $this->templateEngine->setTemplate('orderoverview.twig');
 
killedBy: Controller\OrderOverviewControllerTest::testDataConstruct
statusReason: 1) Controller\OrderOverviewControllerTest::testDataConstruct
Failed asserting that null is of type array.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/OrderOverviewControllerTest.php:74

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/OrderOverviewController.php:28:9
 
         $this->templateEngine->addParameter('order', $order);
         $this->templateEngine->addParameter('basket', $basket);
-        $this->templateEngine->setTemplate('orderoverview.twig');
+        
 
         return $this->templateEngine;
killedBy: Controller\OrderOverviewControllerTest::testDataConstruct
statusReason: 1) Controller\OrderOverviewControllerTest::testDataConstruct
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/OrderOverviewControllerTest.php:76

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.
