[Killed] MethodCallRemoval
Controller/ThankYouController.php:33:9
         $basket = $this->basketRepository->getBasketInfo();
         $order = $this->orderRepository->getOrderInformation();
 
-        $this->orderEntityManager->saveOrder($order);
+        
         $orderID = $this->orderRepository->getOrderId();
         $this->clientEntityManager->emptyBasket();
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
TypeError: App\Model\OrderRepository::getOrderId(): Return value must be of type int, null returned

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderRepository.php:52
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/ThankYouController.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTe

[Survived] MethodCallRemoval
Controller/ThankYouController.php:35:9
 
         $this->orderEntityManager->saveOrder($order);
         $orderID = $this->orderRepository->getOrderId();
-        $this->clientEntityManager->emptyBasket();
+        
 
         $this->templateEngine->addParameter('orderID', $orderID);

[Killed] MethodCallRemoval
Controller/ThankYouController.php:37:9
         $orderID = $this->orderRepository->getOrderId();
         $this->clientEntityManager->emptyBasket();
 
-        $this->templateEngine->addParameter('orderID', $orderID);
+        
         $this->templateEngine->addParameter('basket', $basket);
         $this->templateEngine->addParameter('order', $order);
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
Failed asserting that null is of type int.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTest.php:72

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/ThankYouController.php:38:9
         $this->clientEntityManager->emptyBasket();
 
         $this->templateEngine->addParameter('orderID', $orderID);
-        $this->templateEngine->addParameter('basket', $basket);
+        
         $this->templateEngine->addParameter('order', $order);
         $this->templateEngine->setTemplate('thankyou.twig');
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
Failed asserting that null is of type array.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTest.php:73

FAILURES!
Tests: 1, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/ThankYouController.php:39:9
 
         $this->templateEngine->addParameter('orderID', $orderID);
         $this->templateEngine->addParameter('basket', $basket);
-        $this->templateEngine->addParameter('order', $order);
+        
         $this->templateEngine->setTemplate('thankyou.twig');
 
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
Failed asserting that null is an instance of class App\Core\DTO\OrderDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTest.php:74

FAILURES!
Tests: 1, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/ThankYouController.php:40:9
         $this->templateEngine->addParameter('orderID', $orderID);
         $this->templateEngine->addParameter('basket', $basket);
         $this->templateEngine->addParameter('order', $order);
-        $this->templateEngine->setTemplate('thankyou.twig');
+        
 
         return $this->templateEngine;
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
Error: Typed property App\Core\TemplateEngine::$tpl must not be accessed before initialization

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/TemplateEngine.php:43
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTest.php:75

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.
