[Killed] PublicVisibility
Core/API/ApiCache.php:15:5
         $this->apiHandler = $apiHandler;
     }
 
-    public function getData(string $type, $id) {
+    protected function getData(string $type, $id)
         $cacheFilePath = $this->getCacheFilePath($type, $id);
 
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Core\API\ApiCache::getData() from scope App\Model\PlayerRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/PlayerRepository.php:27
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/HomepageController.php:33
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControll

[Killed] IfNegation
Core/API/ApiCache.php:18:9
     public function getData(string $type, $id) {
         $cacheFilePath = $this->getCacheFilePath($type, $id);
 
-        if ($this->isCacheValid($cacheFilePath)) {
-            return $this->loadFromCache($cacheFilePath);
-        }
+        if (!$this->isCacheValid($cacheFilePath)) {
 
         switch ($type) {
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:23
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:27
/home/nicogruenewald/Documents/BuyMy

[NoCoverage] Throw_
Core/API/ApiCache.php:32:17
                 break;
 
             default:
-                throw new \Exception("Invalid request type: $type");
+                new \Exception("Invalid request type: {$type}");
         }
 

[NoCoverage] MethodCallRemoval
Core/API/ApiCache.php:35:9
                 throw new \Exception("Invalid request type: $type");
         }
 
-        $this->saveToCache($data, $cacheFilePath);
+        
         return $data;
     }

[Killed] LogicalNot
Core/API/ApiCache.php:40:9
     }
 
     private function isCacheValid(string $cacheFilePath): bool {
-        if (!file_exists($cacheFilePath)) {
+        if (file_exists($cacheFilePath)) {
             return false;
         }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:18
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:24
/home/nicogruenewald/Documents/BuyMyT

[NoCoverage] FalseValue
Core/API/ApiCache.php:41:13
 
     private function isCacheValid(string $cacheFilePath): bool {
         if (!file_exists($cacheFilePath)) {
-            return false;
+            return true;
         }
 

[Killed] Minus
Core/API/ApiCache.php:45:9
         }
 
         $fileTime = filemtime($cacheFilePath);
-        return (time() - $fileTime) <= $this->cacheDuration;
+        return time() + $fileTime <= $this->cacheDuration;
     }
 
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:18
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:24
/home/nicogruenewald/Documents/BuyMyT

[Killed] LessThanOrEqualToNegotiation
Core/API/ApiCache.php:45:9
         }
 
         $fileTime = filemtime($cacheFilePath);
-        return (time() - $fileTime) <= $this->cacheDuration;
+        return time() - $fileTime > $this->cacheDuration;
     }
 
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:18
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:24
/home/nicogruenewald/Documents/BuyMyT

[NoCoverage] FunctionCallRemoval
Core/API/ApiCache.php:53:9
     }
 
     private function saveToCache(array $data, string $cacheFilePath): void {
-        file_put_contents($cacheFilePath, json_encode($data));
+        
     }
 

[Killed] ConcatOperandRemoval
Core/API/ApiCache.php:57:9
     }
 
     private function getCacheFilePath(string $type, $id): string {
-        return $this->cacheFileDir . "/{$type}_{$id}.json";
+        return "/{$type}_{$id}.json";
     }
 }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:18
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:24
/home/nicogruenewald/Documents/BuyMyT

[Killed] ConcatOperandRemoval
Core/API/ApiCache.php:57:9
     }
 
     private function getCacheFilePath(string $type, $id): string {
-        return $this->cacheFileDir . "/{$type}_{$id}.json";
+        return $this->cacheFileDir;
     }
 }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
TypeError: json_decode(): Argument #1 ($json) must be of type string, bool given

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:13
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiHandling.php:18
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/API/ApiCache.php:24
/home/nicogruenewald/Documents/BuyMyT
