[NoCoverage] Concat
Core/API/ApiHandling.php:12:9
         $reqPrefs['http']['method'] = 'GET';
         $reqPrefs['http']['header'] = 'X-Auth-Token: a6c8d6df34f64da0a3d3bbe5beed6ea7';
         $stream_context = stream_context_create($reqPrefs);
-        $response = file_get_contents('http://api.football-data.org/v4/' . $url, false, $stream_context);
+        $response = file_get_contents($url . 'http://api.football-data.org/v4/', false, $stream_context);
         return json_decode($response, true, 512, JSON_THROW_ON_ERROR);
     }

[NoCoverage] ConcatOperandRemoval
Core/API/ApiHandling.php:12:9
         $reqPrefs['http']['method'] = 'GET';
         $reqPrefs['http']['header'] = 'X-Auth-Token: a6c8d6df34f64da0a3d3bbe5beed6ea7';
         $stream_context = stream_context_create($reqPrefs);
-        $response = file_get_contents('http://api.football-data.org/v4/' . $url, false, $stream_context);
+        $response = file_get_contents('http://api.football-data.org/v4/', false, $stream_context);
         return json_decode($response, true, 512, JSON_THROW_ON_ERROR);
     }

[NoCoverage] DecrementInteger
Core/API/ApiHandling.php:13:9
         $reqPrefs['http']['header'] = 'X-Auth-Token: a6c8d6df34f64da0a3d3bbe5beed6ea7';
         $stream_context = stream_context_create($reqPrefs);
         $response = file_get_contents('http://api.football-data.org/v4/' . $url, false, $stream_context);
-        return json_decode($response, true, 512, JSON_THROW_ON_ERROR);
+        return json_decode($response, true, 511, JSON_THROW_ON_ERROR);
     }
 

[NoCoverage] IncrementInteger
Core/API/ApiHandling.php:13:9
         $reqPrefs['http']['header'] = 'X-Auth-Token: a6c8d6df34f64da0a3d3bbe5beed6ea7';
         $stream_context = stream_context_create($reqPrefs);
         $response = file_get_contents('http://api.football-data.org/v4/' . $url, false, $stream_context);
-        return json_decode($response, true, 512, JSON_THROW_ON_ERROR);
+        return json_decode($response, true, 513, JSON_THROW_ON_ERROR);
     }
 

[NoCoverage] PublicVisibility
Core/API/ApiHandling.php:16:5
         return json_decode($response, true, 512, JSON_THROW_ON_ERROR);
     }
 
-    public function requestPlayers($teamID) : array
+    protected function requestPlayers($teamID) : array
     {
         return $this->makeApiRequest('teams/' . $teamID);

[NoCoverage] ConcatOperandRemoval
Core/API/ApiHandling.php:18:9
 
     public function requestPlayers($teamID) : array
     {
-        return $this->makeApiRequest('teams/' . $teamID);
+        return $this->makeApiRequest('teams/');
     }
 

[NoCoverage] ConcatOperandRemoval
Core/API/ApiHandling.php:18:9
 
     public function requestPlayers($teamID) : array
     {
-        return $this->makeApiRequest('teams/' . $teamID);
+        return $this->makeApiRequest($teamID);
     }
 

[NoCoverage] PublicVisibility
Core/API/ApiHandling.php:21:5
         return $this->makeApiRequest('teams/' . $teamID);
     }
 
-    public function requestItemInfo($itemID) : array
+    protected function requestItemInfo($itemID) : array
     {
         return $this->makeApiRequest('persons/' . $itemID['item_id']);

[NoCoverage] ConcatOperandRemoval
Core/API/ApiHandling.php:23:9
 
     public function requestItemInfo($itemID) : array
     {
-        return $this->makeApiRequest('persons/' . $itemID['item_id']);
+        return $this->makeApiRequest('persons/');
 
     }

[NoCoverage] Concat
Core/API/ApiHandling.php:23:9
 
     public function requestItemInfo($itemID) : array
     {
-        return $this->makeApiRequest('persons/' . $itemID['item_id']);
+        return $this->makeApiRequest($itemID['item_id'] . 'persons/');
 
     }
