[Killed] PublicVisibility
Core/Basket/BasketManipulator.php:22:5
         $this->clientEntityManager = new ClientEntityManager();
     }
 
-    public function addItemToBasket() : void
+    protected function addItemToBasket() : void
     {
        $userID = $this->clientRepository->getUserID($this->sessionHandler->getSessionMail());
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Error: Call to protected method App\Core\Basket\BasketManipulator::addItemToBasket() from scope Core\Basket\BasketManipulatorTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:54

2) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Error: Call to protected method App\Core\Basket\BasketMa

[Killed] MethodCallRemoval
Core/Basket/BasketManipulator.php:28:8
 
        $itemID = $_GET['id'];
 
-       $this->clientEntityManager->addToBasket($itemID, $userID);
+       
     }
 
killedBy: Core\Basket\BasketManipulatorTest::testAddItemToBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:46

FAILURES!
Tests: 2, Assertions: 2, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Core/Basket/BasketManipulator.php:31:5
        $this->clientEntityManager->addToBasket($itemID, $userID);
     }
 
-    public function removeItemFromBasket() : void
+    protected function removeItemFromBasket() : void
     {
         $userID = $this->clientRepository->getUserID($this->sessionHandler->getSessionMail());
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Error: Call to protected method App\Core\Basket\BasketManipulator::removeItemFromBasket() from scope Core\Basket\BasketManipulatorTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:56

2) Controller\BasketControllerTest::testDataConstructRemove
Error: Call to protected method App\Core\Basket\B

[Killed] MethodCallRemoval
Core/Basket/BasketManipulator.php:37:9
 
         $itemID = $_GET['id'];
 
-        $this->clientEntityManager->removeFromBasket($itemID, $userID);
+        
     }
 }
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:60

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.
