[Killed] Foreach_
Core/Container.php:23:9
 
     public function getList(): array
     {
-        foreach ($this->object as $item)
-        {
-            $array [] = $item;
-        }
+        foreach (array() as $item) {
         return $array;
     }
killedBy: Tests\Core\DependencyProviderTest::testProvide
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
TypeError: App\Core\Container::getList(): Return value must be of type array, null returned

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/Container.php:22
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1, Warnings: 1.
