[Killed] PublicVisibility
Core/ControllerProvider.php:18:5
 
 class ControllerProvider
 {
-    public function getList(): array
+    protected function getList() : array
     {
         return [
killedBy: Core\ControllerProviderTest::testGetList
statusReason: 1) Core\ControllerProviderTest::testGetList
Error: Call to protected method App\Core\ControllerProvider::getList() from scope Core\ControllerProviderTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/ControllerProviderTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
