[Killed] PublicVisibility
Core/DTO/ErrorDTO.php:13:5
     {
     }
 
-    public function getMessage()
+    protected function getMessage()
     {
         return $this->message;
killedBy: Core\DTO\ErrorDTOTest::testProperties
statusReason: 1) Core\DTO\ErrorDTOTest::testProperties
Error: Call to protected method App\Core\DTO\ErrorDTO::getMessage() from scope Core\DTO\ErrorDTOTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DTO/ErrorDTOTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
