[Killed] PublicVisibility
Core/DependencyProvider.php:22:5
 
 class DependencyProvider
 {
-    public function provide(Container $container): void
+    protected function provide(Container $container) : void
     {
         $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Core\DependencyProvider::provide() from scope Controller\HomepageControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:66

2) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\DependencyProvider::provide() from sco

[Killed] ConcatOperandRemoval
Core/DependencyProvider.php:24:9
 {
     public function provide(Container $container): void
     {
-        $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
+        $container->set(TemplateEngine::class, new TemplateEngine(__DIR__));
         $container->set(PlayerRepository::class, new PlayerRepository());
         $container->set(ClientRepository::class, new ClientRepository());
killedBy: Tests\Core\DependencyProviderTest::testProvide
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/../../src/View/templates'
+'/home/nicogruenewald/Documents/BuyMyTrikots/src/Core'

[Killed] Concat
Core/DependencyProvider.php:24:9
 {
     public function provide(Container $container): void
     {
-        $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
+        $container->set(TemplateEngine::class, new TemplateEngine('/../../src/View/templates' . __DIR__));
         $container->set(PlayerRepository::class, new PlayerRepository());
         $container->set(ClientRepository::class, new ClientRepository());
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Twig\Error\LoaderError: The "/../../src/View/templates/home/nicogruenewald/Documents/BuyMyTrikots/src/Core" directory does not exist ("/../../src/View/templates/home/nicogruenewald/Documents/BuyMyTrikots/src/Core").

/home/nicogruenewald/Documents/BuyMyTrikots/vendor/twig/twig/src/Loader/FilesystemLoader.php:92
/home/nicogruenewald/Documents/

[Killed] MethodCallRemoval
Core/DependencyProvider.php:25:9
     public function provide(Container $container): void
     {
         $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
-        $container->set(PlayerRepository::class, new PlayerRepository());
+        
         $container->set(ClientRepository::class, new ClientRepository());
         $container->set(ClientEntityManager::class, new ClientEntityManager());
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:41

ERRORS!
Tests: 19, Assertions: 67, Errors: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:26:9
     {
         $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
         $container->set(PlayerRepository::class, new PlayerRepository());
-        $container->set(ClientRepository::class, new ClientRepository());
+        
         $container->set(ClientEntityManager::class, new ClientEntityManager());
         $container->set(ClientMapper::class, new ClientMapper());
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidName
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:45

ERRORS!
Tests: 19, Assertions: 27, Errors: 12, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:27:9
         $container->set(TemplateEngine::class, new TemplateEngine(__DIR__ . '/../../src/View/templates'));
         $container->set(PlayerRepository::class, new PlayerRepository());
         $container->set(ClientRepository::class, new ClientRepository());
-        $container->set(ClientEntityManager::class, new ClientEntityManager());
+        
         $container->set(ClientMapper::class, new ClientMapper());
         $container->set(ClientValidator::class, new ClientValidator());
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:49

ERRORS!
Tests: 19, Assertions: 30, Errors: 10, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:28:9
         $container->set(PlayerRepository::class, new PlayerRepository());
         $container->set(ClientRepository::class, new ClientRepository());
         $container->set(ClientEntityManager::class, new ClientEntityManager());
-        $container->set(ClientMapper::class, new ClientMapper());
+        
         $container->set(ClientValidator::class, new ClientValidator());
         $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
killedBy: Tests\Core\DependencyProviderTest::testProvide
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:53

FAILURES!
Tests: 19, Assertions: 77, Failures: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:29:9
         $container->set(ClientRepository::class, new ClientRepository());
         $container->set(ClientEntityManager::class, new ClientEntityManager());
         $container->set(ClientMapper::class, new ClientMapper());
-        $container->set(ClientValidator::class, new ClientValidator());
+        
         $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
         $container->set(ClientDTO::class, new ClientDTO());
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:57

ERRORS!
Tests: 19, Assertions: 38, Errors: 9, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:30:9
         $container->set(ClientEntityManager::class, new ClientEntityManager());
         $container->set(ClientMapper::class, new ClientMapper());
         $container->set(ClientValidator::class, new ClientValidator());
-        $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
+        
         $container->set(ClientDTO::class, new ClientDTO());
         $container->set(BasketRepository::class, new BasketRepository());
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:61

ERRORS!
Tests: 19, Assertions: 77, Errors: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:31:9
         $container->set(ClientMapper::class, new ClientMapper());
         $container->set(ClientValidator::class, new ClientValidator());
         $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
-        $container->set(ClientDTO::class, new ClientDTO());
+        
         $container->set(BasketRepository::class, new BasketRepository());
         $container->set(BasketManipulator::class, new BasketManipulator());
killedBy: Controller\ClientLoginControllerTest::testDataConstructInvalidRequestMethod
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:65

ERRORS!
Tests: 19, Assertions: 78, Errors: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:32:9
         $container->set(ClientValidator::class, new ClientValidator());
         $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
         $container->set(ClientDTO::class, new ClientDTO());
-        $container->set(BasketRepository::class, new BasketRepository());
+        
         $container->set(BasketManipulator::class, new BasketManipulator());
         $container->set(OrderRepository::class, new OrderRepository());
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:69

ERRORS!
Tests: 19, Assertions: 69, Errors: 5, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:33:9
         $container->set(SearchEngine::class, new SearchEngine(new Redirect()));
         $container->set(ClientDTO::class, new ClientDTO());
         $container->set(BasketRepository::class, new BasketRepository());
-        $container->set(BasketManipulator::class, new BasketManipulator());
+        
         $container->set(OrderRepository::class, new OrderRepository());
         $container->set(OrderEntityManager::class, new OrderEntityManager());
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:73

ERRORS!
Tests: 19, Assertions: 79, Errors: 2, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:34:9
         $container->set(ClientDTO::class, new ClientDTO());
         $container->set(BasketRepository::class, new BasketRepository());
         $container->set(BasketManipulator::class, new BasketManipulator());
-        $container->set(OrderRepository::class, new OrderRepository());
+        
         $container->set(OrderEntityManager::class, new OrderEntityManager());
         $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:77

ERRORS!
Tests: 19, Assertions: 81, Errors: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:35:9
         $container->set(BasketRepository::class, new BasketRepository());
         $container->set(BasketManipulator::class, new BasketManipulator());
         $container->set(OrderRepository::class, new OrderRepository());
-        $container->set(OrderEntityManager::class, new OrderEntityManager());
+        
         $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
         $container->set(RedirectSpy::class, new RedirectSpy());
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:81

ERRORS!
Tests: 19, Assertions: 87, Errors: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:36:9
         $container->set(BasketManipulator::class, new BasketManipulator());
         $container->set(OrderRepository::class, new OrderRepository());
         $container->set(OrderEntityManager::class, new OrderEntityManager());
-        $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
+        
         $container->set(RedirectSpy::class, new RedirectSpy());
         $container->set(Redirect::class, new Redirect());
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:85

ERRORS!
Tests: 19, Assertions: 92, Errors: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:37:9
         $container->set(OrderRepository::class, new OrderRepository());
         $container->set(OrderEntityManager::class, new OrderEntityManager());
         $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
-        $container->set(RedirectSpy::class, new RedirectSpy());
+        
         $container->set(Redirect::class, new Redirect());
         $container->set(SessionHandler::class, new SessionHandler());
killedBy: Tests\Core\DependencyProviderTest::testProvide
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:89

FAILURES!
Tests: 19, Assertions: 95, Failures: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:38:9
         $container->set(OrderEntityManager::class, new OrderEntityManager());
         $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
         $container->set(RedirectSpy::class, new RedirectSpy());
-        $container->set(Redirect::class, new Redirect());
+        
         $container->set(SessionHandler::class, new SessionHandler());
     }
killedBy: Tests\Core\DependencyProviderTest::testProvide
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:93

FAILURES!
Tests: 19, Assertions: 97, Failures: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:39:9
         $container->set(BillingValidator::class, new BillingValidator(new Redirect()));
         $container->set(RedirectSpy::class, new RedirectSpy());
         $container->set(Redirect::class, new Redirect());
-        $container->set(SessionHandler::class, new SessionHandler());
+        
     }
 }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Tests\Core\DependencyProviderTest::testProvide
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/DependencyProviderTest.php:97

ERRORS!
Tests: 19, Assertions: 82, Errors: 6, Failures: 1, Warnings: 1.
