[Killed] PublicVisibility
Core/Mapper/ApiMapper.php:14:5
      * @param $array
      * @return PlayerDTO[]
      */
-    public function Map($array) : array
+    protected function Map($array) : array
     {
         $list = [];
killedBy: Model\PlayerRepositoryTest::testGetPlayers
statusReason: 1) Model\PlayerRepositoryTest::testGetPlayers
Error: Call to protected method App\Core\Mapper\ApiMapper::Map() from scope App\Model\PlayerRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/PlayerRepository.php:29
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/PlayerRepositoryTest.php:42

2) Core\Mapper\ApiMapperTest::testMapMultipleItemsInArray
Error: Call to protected meth

[Killed] Foreach_
Core/Mapper/ApiMapper.php:17:9
     public function Map($array) : array
     {
         $list = [];
-        foreach ($array['squad'] ?? [] as $item)
-        {
-            $DTO = new PlayerDTO();
-            $DTO->id = $item['id'];
-            $DTO->name = $item['name'];
-            $DTO->nationality = $item['nationality'];
-            $DTO->dateOfBirth = $item['dateOfBirth'];
-            $DTO->clubEmblem = $array['crest'];
-            $DTO->clubAddress = $array['address'];
-            $DTO->clubFounded = $array['founded'];
-            $DTO->clubName = $array['name'];
-            $DTO->clubWebsite = $array['website'];
-
-            $list [] = $DTO;
-        }
+        foreach (array() as $item) {
         return $list;
     }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Failed asserting that an array is not empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:77

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Coalesce
Core/Mapper/ApiMapper.php:17:9
     public function Map($array) : array
     {
         $list = [];
-        foreach ($array['squad'] ?? [] as $item)
+        foreach ([] ?? $array['squad'] as $item) {
         {
             $DTO = new PlayerDTO();
killedBy: Core\Mapper\ApiMapperTest::testMapMultipleItemsInArray
statusReason: 1) Core\Mapper\ApiMapperTest::testMapMultipleItemsInArray
Failed asserting that null is identical to '156967'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Mapper/ApiMapperTest.php:548

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 2.

[Killed] PublicVisibility
Core/Mapper/ApiMapper.php:35:5
         return $list;
     }
 
-    public function MapBasket($array, $quantity) : BasketDTO
+    protected function MapBasket($array, $quantity) : BasketDTO
     {
             $DTO = new BasketDTO();
killedBy: Controller\OrderOverviewControllerTest::testDataConstruct
statusReason: 1) Controller\OrderOverviewControllerTest::testDataConstruct
Error: Call to protected method App\Core\Mapper\ApiMapper::MapBasket() from scope App\Model\BasketRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:36
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/OrderOverviewController.php:24
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/

[Killed] ConcatOperandRemoval
Core/Mapper/ApiMapper.php:38:13
     public function MapBasket($array, $quantity) : BasketDTO
     {
             $DTO = new BasketDTO();
-            $DTO->name = $array['name'] . ' Trikot';
+            $DTO->name = $array['name'];
             $DTO->icon = $array['currentTeam']['crest'];
             $DTO->id = $array['id'];
killedBy: Core\Basket\BasketManipulatorTest::testAddItemToBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Cristiano Ronaldo Trikot'
+'Cristiano Ronaldo'

[Killed] ConcatOperandRemoval
Core/Mapper/ApiMapper.php:38:13
     public function MapBasket($array, $quantity) : BasketDTO
     {
             $DTO = new BasketDTO();
-            $DTO->name = $array['name'] . ' Trikot';
+            $DTO->name = ' Trikot';
             $DTO->icon = $array['currentTeam']['crest'];
             $DTO->id = $array['id'];
killedBy: Core\Basket\BasketManipulatorTest::testAddItemToBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Cristiano Ronaldo Trikot'
+' Trikot'

[Killed] IncrementInteger
Core/Mapper/ApiMapper.php:41:13
             $DTO->name = $array['name'] . ' Trikot';
             $DTO->icon = $array['currentTeam']['crest'];
             $DTO->id = $array['id'];
-            $DTO->quantity = $quantity[0]['quantity'];
+            $DTO->quantity = $quantity[1]['quantity'];
 
         return $DTO;
killedBy: Controller\OrderOverviewControllerTest::testDataConstruct
statusReason: 1) Controller\OrderOverviewControllerTest::testDataConstruct
TypeError: Cannot assign null to property App\Core\DTO\BasketDTO::$quantity of type string

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/Mapper/ApiMapper.php:37
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:36
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/OrderOverviewController.php:24
/h
