[Killed] PublicVisibility
Core/Mapper/BillingMapper.php:9:5
 
 class BillingMapper
 {
-    public function mapBilling($array) : OrderDTO
+    protected function mapBilling($array) : OrderDTO
     {
         $billing = new OrderDTO();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Mapper\BillingMapper::mapBilling() from scope App\Model\OrderRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderRepository.php:38
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:29
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/Checkou
