[Killed] PublicVisibility
Core/Mapper/ClientMapper.php:16:5
     }
 
 
-    public function mapFromArray2Dto(array $data): ?ClientDTO
+    protected function mapFromArray2Dto(array $data) : ?ClientDTO
     {
         foreach ($data as $entry) {
killedBy: Model\ClientRepositoryTest::testCheckLoginCredentialsInvalid
statusReason: 1) Model\ClientRepositoryTest::testCheckLoginCredentialsInvalid
Error: Call to protected method App\Core\Mapper\ClientMapper::mapFromArray2Dto() from scope App\Model\ClientRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientRepository.php:21
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientRepository.php:26
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/Clie

[Killed] Foreach_
Core/Mapper/ClientMapper.php:18:9
 
     public function mapFromArray2Dto(array $data): ?ClientDTO
     {
-        foreach ($data as $entry) {
-            $userDTO = new ClientDTO();
-            $userDTO->id = $entry['id'];
-            $userDTO->username = $entry['username'];
-            $userDTO->email = $entry['email'];
-            $userDTO->password = $entry['password'];
-
-        }
+        foreach (array() as $entry) {
         return $userDTO ?? null;
     }
killedBy: Model\ClientRepositoryTest::testFindByMail
statusReason: 1) Model\ClientRepositoryTest::testFindByMail
Failed asserting that null is an instance of class App\Core\DTO\ClientDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:42

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
