[NoCoverage] ConcatOperandRemoval
Core/Redirect/Redirect.php:11:9
 
     public function to(string $location): void
     {
-        header('Location: ' . $this->url . $location);
+        header($this->url . $location);
     }
 }

[NoCoverage] ConcatOperandRemoval
Core/Redirect/Redirect.php:11:9
 
     public function to(string $location): void
     {
-        header('Location: ' . $this->url . $location);
+        header('Location: ' . $location);
     }
 }
