[Killed] PublicVisibility
Core/SQL/SqlConnector.php:18:5
     {
     }
 
-    public function connect(): void
+    protected function connect() : void
     {
         if ($this->pdo === null) {
killedBy: Core\SQL\SqlConnectorTest::testSqlException
statusReason: 1) Core\SQL\SqlConnectorTest::testSqlException
Error: Call to protected method App\Core\SQL\SqlConnector::connect() from scope Core\SQL\SqlConnectorTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/SQL/SqlConnectorTest.php:27

2) Core\SQL\SqlConnectorTest::testConnect
Error: Call to protected method App\Core\SQL\SqlConnector::connect() from scope Core\SQL\SqlConnectorTest

[Killed] Identical
Core/SQL/SqlConnector.php:20:9
 
     public function connect(): void
     {
-        if ($this->pdo === null) {
+        if ($this->pdo !== null) {
 
             $this->dbName = $_ENV['DATABASE'] ?? 'users';
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Core\SQL\SqlConnectorTest::testSqlException
Failed asserting that exception of type "Error" matches expected exception "PDOException". Message was: "Call to a member function prepare() on null" at
/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/SQL/SqlConnectorTest.php:31
.

ERRORS!
Tests: 15, Assertions: 34, Er

[Killed] Coalesce
Core/SQL/SqlConnector.php:22:13
     {
         if ($this->pdo === null) {
 
-            $this->dbName = $_ENV['DATABASE'] ?? 'users';
+            $this->dbName = 'users' ?? $_ENV['DATABASE'];
 
             $dbHost = "localhost:3337";
killedBy: Core\SQL\SqlConnectorTest::testConnect
statusReason: 1) Core\SQL\SqlConnectorTest::testConnect
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'user_test'
+'users'

[Killed] PublicVisibility
Core/SQL/SqlConnector.php:32:5
         }
     }
 
-    public function getDatabaseName(): string
+    protected function getDatabaseName() : string
     {
         return $this->dbName;
killedBy: Core\SQL\SqlConnectorTest::testConnect
statusReason: 1) Core\SQL\SqlConnectorTest::testConnect
Error: Call to protected method App\Core\SQL\SqlConnector::getDatabaseName() from scope Core\SQL\SqlConnectorTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/SQL/SqlConnectorTest.php:22

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Core/SQL/SqlConnector.php:37:5
         return $this->dbName;
     }
 
-    public function executeSelectQuery(string $query, array $params): array
+    protected function executeSelectQuery(string $query, array $params) : array
     {
         $this->connect();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Core\SQL\SqlConnectorTest::testSqlException
Failed asserting that exception of type "Error" matches expected exception "PDOException". Message was: "Call to protected method App\Core\SQL\SqlConnector::executeSelectQuery() from scope Core\SQL\SqlConnectorTest" at
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/SQL/SqlConnectorTest.php:31
.

ERRORS!
Tests: 14, Assertions: 35, Errors: 5, Fa

[Killed] MethodCallRemoval
Core/SQL/SqlConnector.php:39:9
 
     public function executeSelectQuery(string $query, array $params): array
     {
-        $this->connect();
+        
         $stmt = $this->pdo->prepare($query);
         foreach ($params as $key => $value) {
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to a member function prepare() on null

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientRepository.php:40
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/

[Killed] Foreach_
Core/SQL/SqlConnector.php:41:9
     {
         $this->connect();
         $stmt = $this->pdo->prepare($query);
-        foreach ($params as $key => $value) {
-            $stmt->bindValue($key, $value, PDO::PARAM_STR);
-        }
+        foreach (array() as $key => $value) {
         $stmt->execute();
         return $stmt->fetchAll(PDO::FETCH_ASSOC);
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ':mail' at line 1

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:35
/home/nicogruenewald/Documents/BuyMyTrikots/

[Killed] MethodCallRemoval
Core/SQL/SqlConnector.php:42:13
         $this->connect();
         $stmt = $this->pdo->prepare($query);
         foreach ($params as $key => $value) {
-            $stmt->bindValue($key, $value, PDO::PARAM_STR);
+            
         }
         $stmt->execute();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ':mail' at line 1

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:35
/home/nicogruenewald/Documents/BuyMyTrikots/

[Killed] MethodCallRemoval
Core/SQL/SqlConnector.php:44:9
         foreach ($params as $key => $value) {
             $stmt->bindValue($key, $value, PDO::PARAM_STR);
         }
-        $stmt->execute();
+        
         return $stmt->fetchAll(PDO::FETCH_ASSOC);
     }
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 2, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Core/SQL/SqlConnector.php:49:5
     }
 
 
-    public function executeInsertQuery(string $query, array $params): string
+    protected function executeInsertQuery(string $query, array $params) : string
     {
         $this->connect();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\SQL\SqlConnector::executeInsertQuery() from scope App\Model\ClientEntityManager

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientEntityManager.php:32
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:36

2) Controller\BasketControllerTest::testDataConst

[Killed] Foreach_
Core/SQL/SqlConnector.php:54:9
         $this->connect();
         $stmt = $this->pdo->prepare($query);
 
-        foreach ($params as $key => $value) {
-            $stmt->bindValue($key, $value, PDO::PARAM_STR);
-        }
+        foreach (array() as $key => $value) {
 
         $stmt->execute();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ':username, :email, :password)' at line 1

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:45
/home/nicogruenewald

[Killed] MethodCallRemoval
Core/SQL/SqlConnector.php:58:9
             $stmt->bindValue($key, $value, PDO::PARAM_STR);
         }
 
-        $stmt->execute();
+        
 
         return $this->pdo->lastInsertId();
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:64

FAILURES!
Tests: 2, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Core/SQL/SqlConnector.php:63:5
         return $this->pdo->lastInsertId();
     }
 
-    public function executeDeleteQuery(string $query, array $params): string
+    protected function executeDeleteQuery(string $query, array $params) : string
     {
         $this->connect();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Model\OrderEntityManagerTest::testSaveOrderValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"id": "44", "quantity": "1"}'
+'[]'

[Killed] Foreach_
Core/SQL/SqlConnector.php:69:9
         $stmt = $this->pdo->prepare($query);
 
         // Bind parameters manually
-        foreach ($params as $key => $value) {
-            $stmt->bindValue($key, $value, PDO::PARAM_STR);
-        }
+        foreach (array() as $key => $value) {
 
         // Execute the query
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Controller\BasketControllerTest::testDataConstructRemove
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ':item_id AND user_id = :user_id' at line 1

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:57
/home/nicogrue

[Killed] MethodCallRemoval
Core/SQL/SqlConnector.php:74:9
         }
 
         // Execute the query
-        $stmt->execute();
+        
 
         // Return the last inserted ID
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Controller\BasketControllerTest::testDataConstructRemove
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:81

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Core/SQL/SqlConnector.php:80:5
         return $this->pdo->lastInsertId();
     }
 
-    public function closeConnection(): void
+    protected function closeConnection() : void
     {
         $this->pdo = null;
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\SQL\SqlConnector::closeConnection() from scope Controller\CheckoutControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:52

2) Controller\BasketControllerTest::testDataConstructRemove
Error: Call to protected method App\Core\SQL\SqlConnector::closeConne
