[Killed] PublicVisibility
Core/SearchEngine.php:16:5
     {
         $this->redirect = $redirect;
     }
-    public function search() : void
+    protected function search() : void
     {
         if(!empty($_POST['search']))
killedBy: Core\SearchEngineTest::testSearchWithEmptyTerm
statusReason: 1) Core\SearchEngineTest::testSearchWithEmptyTerm
Error: Call to protected method App\Core\SearchEngine::search() from scope Core\SearchEngineTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/SearchEngineTest.php:37

2) Core\SearchEngineTest::testSearchWithTerm
Error: Call to protected method App\Core\SearchEngine::search() from scope Core\SearchEngineTest

[Killed] LogicalNot
Core/SearchEngine.php:18:9
     }
     public function search() : void
     {
-        if(!empty($_POST['search']))
+        if (empty($_POST['search'])) {
         {
             $this->redirect->to('?page=shop&id=' . $_POST['search']);
killedBy: Core\SearchEngineTest::testSearchWithTerm
statusReason: 1) Core\SearchEngineTest::testSearchWithTerm
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop&id=3'
+''

[Killed] MethodCallRemoval
Core/SearchEngine.php:20:13
     {
         if(!empty($_POST['search']))
         {
-            $this->redirect->to('?page=shop&id=' . $_POST['search']);
+            
         }
     }
killedBy: Core\SearchEngineTest::testSearchWithTerm
statusReason: 1) Core\SearchEngineTest::testSearchWithTerm
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop&id=3'
+''

[Killed] ConcatOperandRemoval
Core/SearchEngine.php:20:13
     {
         if(!empty($_POST['search']))
         {
-            $this->redirect->to('?page=shop&id=' . $_POST['search']);
+            $this->redirect->to($_POST['search']);
         }
     }
killedBy: Core\SearchEngineTest::testSearchWithTerm
statusReason: 1) Core\SearchEngineTest::testSearchWithTerm
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=shop&id=3'
+'3'
