[Killed] PublicVisibility
Core/Session/SessionHandler.php:9:5
 {
     public string $session;
 
-    public function getSessionMail() : string
+    protected function getSessionMail() : string
     {
         $this->session = $_SESSION['mail'] ?? '';
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Session\SessionHandler::getSessionMail() from scope App\Model\BasketRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:32
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller

[Killed] Coalesce
Core/Session/SessionHandler.php:11:9
 
     public function getSessionMail() : string
     {
-        $this->session = $_SESSION['mail'] ?? '';
+        $this->session = '' ?? $_SESSION['mail'];
         return $this->session;
     }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'TEST@TEST.com'
+''

[Killed] PublicVisibility
Core/Session/SessionHandler.php:14:5
         $this->session = $_SESSION['mail'] ?? '';
         return $this->session;
     }
-    public function unsetSession(): void
+    protected function unsetSession() : void
     {
         unset($_SESSION['mail']);
killedBy: Controller\ClientLogoutControllerTest::testDataConstruct
statusReason: 1) Controller\ClientLogoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Session\SessionHandler::unsetSession() from scope App\Controller\ClientLogoutController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/ClientLogoutController.php:24
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLogoutControllerTest.php:40

ERRORS!
Tests: 1, Asserti

[Killed] FunctionCallRemoval
Core/Session/SessionHandler.php:17:9
     public function unsetSession(): void
     {
         unset($_SESSION['mail']);
-        session_destroy();
+        
     }
 
killedBy: Controller\ClientLogoutControllerTest::testDataConstruct
statusReason: 1) Controller\ClientLogoutControllerTest::testDataConstruct
Failed asserting that two strings are not identical.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLogoutControllerTest.php:43

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Core/Session/SessionHandler.php:20:5
         session_destroy();
     }
 
-    public function setSession(string $mail): void
+    protected function setSession(string $mail) : void
     {
         if (empty(session_id())) {
killedBy: Controller\ClientLogoutControllerTest::testDataConstruct
statusReason: 1) Controller\ClientLogoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Session\SessionHandler::setSession() from scope Controller\ClientLogoutControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientLogoutControllerTest.php:38

2) Core\Session\SessionHandlerTest::testSetSession
Error: Call to protected method App\Core\Session\SessionHandler::

[Killed] FunctionCallRemoval
Core/Session/SessionHandler.php:23:13
     public function setSession(string $mail): void
     {
         if (empty(session_id())) {
-            session_start();
+            
         }
         $_SESSION['mail'] = $mail;
killedBy: Core\Session\SessionHandlerTest::testSetSession
statusReason: 1) Core\Session\SessionHandlerTest::testSetSession
Failed asserting that a string is not empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Session/SessionHandlerTest.php:24

FAILURES!
Tests: 3, Assertions: 17, Failures: 1.

[Killed] PublicVisibility
Core/Session/SessionHandler.php:28:5
         $_SESSION['mail'] = $mail;
         $this->session = $_SESSION['mail'];
     }
-    public function setOrderSession($dataKeys) : void
+    protected function setOrderSession($dataKeys) : void
     {
         foreach ($dataKeys as $key) {
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Session\SessionHandler::setOrderSession() from scope App\Model\OrderRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderRepository.php:32
/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:29
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/

[Killed] Foreach_
Core/Session/SessionHandler.php:30:9
     }
     public function setOrderSession($dataKeys) : void
     {
-        foreach ($dataKeys as $key) {
-            if (isset($_POST[$key])) {
-                $_SESSION[$key] = $_POST[$key];
-            }
-        }
+        foreach (array() as $key) {
     }
 
killedBy: Model\OrderRepositoryTest::testGetOrderInformationDHL
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationDHL
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'4.95'
+'0'

[Killed] PublicVisibility
Core/Session/SessionHandler.php:37:5
         }
     }
 
-    public function getOrderSession() : array
+    protected function getOrderSession() : array
     {
         return [
killedBy: Core\Session\SessionHandlerTest::testGetOrderSessionNoInput
statusReason: 1) Core\Session\SessionHandlerTest::testGetOrderSessionNoInput
Error: Call to protected method App\Core\Session\SessionHandler::getOrderSession() from scope Core\Session\SessionHandlerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Session/SessionHandlerTest.php:60

2) Core\Session\SessionHandlerTest::testGetOrderSessionValidInput
Error: Call to protected method App\Core\Session\Sessi
