[Killed] PublicVisibility
Core/TemplateEngine.php:31:5
         echo $this->twig->render($this->tpl, $this->parameters);
     }
 
-    public function setTemplate(string $tpl)
+    protected function setTemplate(string $tpl)
     {
         $this->tpl = $tpl;
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Core\TemplateEngine::setTemplate() from scope App\Controller\HomepageController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/HomepageController.php:37
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:77

2) Controller\CheckoutControllerTest::testDataCons

[Killed] PublicVisibility
Core/TemplateEngine.php:41:5
         return $this->parameters;
     }
 
-    public function getTpl(): string
+    protected function getTpl() : string
     {
         return $this->tpl;
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Core\TemplateEngine::getTpl() from scope Controller\HomepageControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:80

2) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\TemplateEngine::getTpl() from scope Control
