[Killed] PublicVisibility
Core/TotalCalculator.php:16:5
         $this->basketRepository = new BasketRepository();
     }
 
-    public function calculateTotal(): float
+    protected function calculateTotal() : float
     {
         $total = 0.00;
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Core\TotalCalculator::calculateTotal() from scope App\Model\OrderEntityManager

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderEntityManager.php:35
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:59

2) Controller\CheckoutControllerTest::testDataConstruct

[Killed] OneZeroFloat
Core/TotalCalculator.php:18:9
 
     public function calculateTotal(): float
     {
-        $total = 0.00;
+        $total = 1.0;
         if (!empty($_SESSION['delivery'])) {
             if ($_SESSION['delivery'] === 'DHL') {
killedBy: Core\TotalCalculatorTest::testCalculateTotalInvalidDeliveryDeclared
statusReason: 1) Core\TotalCalculatorTest::testCalculateTotalInvalidDeliveryDeclared
Failed asserting that 1.0 is identical to 0.0.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/TotalCalculatorTest.php:70

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] LogicalNot
Core/TotalCalculator.php:19:9
     public function calculateTotal(): float
     {
         $total = 0.00;
-        if (!empty($_SESSION['delivery'])) {
+        if (empty($_SESSION['delivery'])) {
             if ($_SESSION['delivery'] === 'DHL') {
                 $total = $this->basketRepository->getBasketTotal() + 4.95;
killedBy: Core\TotalCalculatorTest::testCalculateTotalValid
statusReason: 1) Core\TotalCalculatorTest::testCalculateTotalValid
Failed asserting that 0.0 is identical to 4.95.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/TotalCalculatorTest.php:57

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 3.

[Killed] Identical
Core/TotalCalculator.php:20:13
     {
         $total = 0.00;
         if (!empty($_SESSION['delivery'])) {
-            if ($_SESSION['delivery'] === 'DHL') {
+            if ($_SESSION['delivery'] !== 'DHL') {
                 $total = $this->basketRepository->getBasketTotal() + 4.95;
             } else if ($_SESSION['delivery'] === 'DPD') {
killedBy: Model\OrderRepositoryTest::testGetOrderInformationDPD
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationDPD
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'3.95'
+'4.95'

[Killed] Plus
Core/TotalCalculator.php:21:17
         $total = 0.00;
         if (!empty($_SESSION['delivery'])) {
             if ($_SESSION['delivery'] === 'DHL') {
-                $total = $this->basketRepository->getBasketTotal() + 4.95;
+                $total = $this->basketRepository->getBasketTotal() - 4.95;
             } else if ($_SESSION['delivery'] === 'DPD') {
                 $total = $this->basketRepository->getBasketTotal() + 3.95;
killedBy: Model\OrderRepositoryTest::testGetOrderInformationDHL
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationDHL
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'4.95'
+'-4.95'

[Killed] Identical
Core/TotalCalculator.php:22:13
         if (!empty($_SESSION['delivery'])) {
             if ($_SESSION['delivery'] === 'DHL') {
                 $total = $this->basketRepository->getBasketTotal() + 4.95;
-            } else if ($_SESSION['delivery'] === 'DPD') {
+            if ($_SESSION['delivery'] !== 'DPD') {
                 $total = $this->basketRepository->getBasketTotal() + 3.95;
             } else if ($_SESSION['delivery'] === 'FedEX') {
killedBy: Model\OrderRepositoryTest::testGetOrderInformationFedEX
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationFedEX
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'9.95'
+'3.95'

[Killed] Plus
Core/TotalCalculator.php:23:17
             if ($_SESSION['delivery'] === 'DHL') {
                 $total = $this->basketRepository->getBasketTotal() + 4.95;
             } else if ($_SESSION['delivery'] === 'DPD') {
-                $total = $this->basketRepository->getBasketTotal() + 3.95;
+                $total = $this->basketRepository->getBasketTotal() - 3.95;
             } else if ($_SESSION['delivery'] === 'FedEX') {
                 $total = $this->basketRepository->getBasketTotal() + 9.95;
killedBy: Model\OrderRepositoryTest::testGetOrderInformationDPD
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationDPD
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'3.95'
+'-3.95'

[Killed] Identical
Core/TotalCalculator.php:24:13
                 $total = $this->basketRepository->getBasketTotal() + 4.95;
             } else if ($_SESSION['delivery'] === 'DPD') {
                 $total = $this->basketRepository->getBasketTotal() + 3.95;
-            } else if ($_SESSION['delivery'] === 'FedEX') {
+            if ($_SESSION['delivery'] !== 'FedEX') {
                 $total = $this->basketRepository->getBasketTotal() + 9.95;
             }
killedBy: Model\OrderRepositoryTest::testGetOrderInformationFedEX
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationFedEX
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'9.95'
+'0'

[Killed] Plus
Core/TotalCalculator.php:25:17
             } else if ($_SESSION['delivery'] === 'DPD') {
                 $total = $this->basketRepository->getBasketTotal() + 3.95;
             } else if ($_SESSION['delivery'] === 'FedEX') {
-                $total = $this->basketRepository->getBasketTotal() + 9.95;
+                $total = $this->basketRepository->getBasketTotal() - 9.949999999999999;
             }
         }
killedBy: Model\OrderRepositoryTest::testGetOrderInformationFedEX
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationFedEX
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'9.95'
+'-9.95'
