[Killed] PublicVisibility
Core/Validation/BillingValidator.php:19:5
         $this->redirect = $redirect;
     }
 
-    public function validate($billingInformation): array
+    protected function validate($billingInformation) : array
     {
         $errorDTOList = [];
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Validation\BillingValidator::validate() from scope App\Controller\CheckoutController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:29
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:45

2) Core\Validation\BillingValidatorTest:

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:23:13
     {
         $errorDTOList = [];
         if (isset($_POST['first_name'])) {
-            $this->validateCity($billingInformation->city, $errorDTOList);
+            
             $this->validateZip($billingInformation->zip, $errorDTOList);
             $this->validateAddress($billingInformation->address, $errorDTOList);
killedBy: Core\Validation\BillingValidatorTest::testValidateCityExceptionEmpty
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateCityExceptionEmpty
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:312

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:24:13
         $errorDTOList = [];
         if (isset($_POST['first_name'])) {
             $this->validateCity($billingInformation->city, $errorDTOList);
-            $this->validateZip($billingInformation->zip, $errorDTOList);
+            
             $this->validateAddress($billingInformation->address, $errorDTOList);
             $this->validateLastName($billingInformation->lastName, $errorDTOList);
killedBy: Core\Validation\BillingValidatorTest::testValidateZipExceptionTooShort
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateZipExceptionTooShort
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:430

FAILURES!
Tests: 27, Assertions: 50, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:25:13
         if (isset($_POST['first_name'])) {
             $this->validateCity($billingInformation->city, $errorDTOList);
             $this->validateZip($billingInformation->zip, $errorDTOList);
-            $this->validateAddress($billingInformation->address, $errorDTOList);
+            
             $this->validateLastName($billingInformation->lastName, $errorDTOList);
             $this->validateFirstName($billingInformation->firstName, $errorDTOList);
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooShort
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooShort
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:480

FAILURES!
Tests: 29, Assertions: 54, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:26:13
             $this->validateCity($billingInformation->city, $errorDTOList);
             $this->validateZip($billingInformation->zip, $errorDTOList);
             $this->validateAddress($billingInformation->address, $errorDTOList);
-            $this->validateLastName($billingInformation->lastName, $errorDTOList);
+            
             $this->validateFirstName($billingInformation->firstName, $errorDTOList);
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateMultipleExceptions
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateMultipleExceptions
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:53

FAILURES!
Tests: 6, Assertions: 7, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:27:13
             $this->validateZip($billingInformation->zip, $errorDTOList);
             $this->validateAddress($billingInformation->address, $errorDTOList);
             $this->validateLastName($billingInformation->lastName, $errorDTOList);
-            $this->validateFirstName($billingInformation->firstName, $errorDTOList);
+            
         }
         return $errorDTOList;
killedBy: Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionEmpty
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionEmpty
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:192

FAILURES!
Tests: 13, Assertions: 20, Failures: 1, Warnings: 1.

[Killed] ArrayOneItem
Core/Validation/BillingValidator.php:29:9
             $this->validateLastName($billingInformation->lastName, $errorDTOList);
             $this->validateFirstName($billingInformation->firstName, $errorDTOList);
         }
-        return $errorDTOList;
+        return count($errorDTOList) > 1 ? array_slice($errorDTOList, 0, 1, true) : $errorDTOList;
     }
 
killedBy: Core\Validation\BillingValidatorTest::testValidateMultipleExceptions
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateMultipleExceptions
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:53

FAILURES!
Tests: 34, Assertions: 62, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Core/Validation/BillingValidator.php:32:5
         return $errorDTOList;
     }
 
-    public function redirectIfValid($array): void
+    protected function redirectIfValid($array) : void
     {
         if (isset($_POST['delivery']) && empty($array)) {
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Core\Validation\BillingValidator::redirectIfValid() from scope App\Controller\CheckoutController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:30
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:45

2) Core\Validation\BillingValidat

[Killed] LogicalAndAllSubExprNegation
Core/Validation/BillingValidator.php:34:9
 
     public function redirectIfValid($array): void
     {
-        if (isset($_POST['delivery']) && empty($array)) {
+        if (!isset($_POST['delivery']) && !empty($array)) {
             $this->redirect->to('?page=order-overview');
         }
killedBy: Core\Validation\BillingValidatorTest::testRedirectIfValid
statusReason: 1) Core\Validation\BillingValidatorTest::testRedirectIfValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=order-overview'
+''

[Killed] LogicalAndNegation
Core/Validation/BillingValidator.php:34:9
 
     public function redirectIfValid($array): void
     {
-        if (isset($_POST['delivery']) && empty($array)) {
+        if (!(isset($_POST['delivery']) && empty($array))) {
             $this->redirect->to('?page=order-overview');
         }
killedBy: Core\Validation\BillingValidatorTest::testRedirectIfValidExceptionErrorArrayNotEmpty
statusReason: 1) Core\Validation\BillingValidatorTest::testRedirectIfValidExceptionErrorArrayNotEmpty
Failed asserting that a string is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:611

FAILURES!
Tests: 35, Assertions: 69, Failures: 1.

[Killed] MethodCallRemoval
Core/Validation/BillingValidator.php:35:13
     public function redirectIfValid($array): void
     {
         if (isset($_POST['delivery']) && empty($array)) {
-            $this->redirect->to('?page=order-overview');
+            
         }
     }
killedBy: Core\Validation\BillingValidatorTest::testRedirectIfValid
statusReason: 1) Core\Validation\BillingValidatorTest::testRedirectIfValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=order-overview'
+''

[Killed] LogicalOr
Core/Validation/BillingValidator.php:42:9
     private function validateFirstName($firstName, &$errorDTOList): void
     {
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
+        if (strlen($firstName) >= 30 && strlen($firstName) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $firstName)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $firstName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your first name doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionTooShort
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionTooShort
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:209

FAILURES!
Tests: 34, Assertions: 64, Failures: 1, Warnings: 1.

[Killed] LessThanOrEqualTo
Core/Validation/BillingValidator.php:42:9
     private function validateFirstName($firstName, &$errorDTOList): void
     {
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
+        if (strlen($firstName) >= 30 || strlen($firstName) < 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $firstName)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $firstName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your first name doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionTooShort
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionTooShort
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:209

FAILURES!
Tests: 8, Assertions: 15, Failures: 1, Warnings: 1.

[Killed] PregMatchRemoveCaret
Core/Validation/BillingValidator.php:43:13
     {
         $firstName = $this->trim($firstName);
         if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $firstName)) {
+            if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/[a-zA-Z\\s-]+$/', $firstName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your first name doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionCaret
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateFirstNameExceptionCaret
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:294

FAILURES!
Tests: 11, Assertions: 22, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Core/Validation/BillingValidator.php:43:13
     {
         $firstName = $this->trim($firstName);
         if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $firstName)) {
+            if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || preg_match('/^[a-zA-Z\\s-]+$/', $firstName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your first name doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidate
statusReason: 1) Core\Validation\BillingValidatorTest::testValidate
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:36

FAILURES!
Tests: 29, Assertions: 53, Failures: 1.

[Killed] GreaterThanOrEqualTo
Core/Validation/BillingValidator.php:51:9
     private function validateLastName($lastName, &$errorDTOList): void
     {
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 ||
+        if (strlen($lastName) > 30 || strlen($lastName) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $lastName)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $lastName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your last name doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateLastNameExceptionTooLong30
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateLastNameExceptionTooLong30
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:123

FAILURES!
Tests: 3, Assertions: 5, Failures: 1, Warnings: 1.

[Killed] LessThanOrEqualToNegotiation
Core/Validation/BillingValidator.php:51:9
     private function validateLastName($lastName, &$errorDTOList): void
     {
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 ||
+        if (strlen($lastName) >= 30 || strlen($lastName) > 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $lastName)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $lastName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your last name doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateLastNameExceptionTooShort1
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateLastNameExceptionTooShort1
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:106

FAILURES!
Tests: 25, Assertions: 47, Failures: 1, Warnings: 1.

[Killed] PregMatchRemoveDollar
Core/Validation/BillingValidator.php:52:13
     {
         $lastName = $this->trim($lastName);
         if (strlen($lastName) >= 30 || strlen($lastName) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $lastName)) {
+            if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[a-zA-Z\\s-]+/', $lastName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your last name doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateLastNameExceptionCharacters
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateLastNameExceptionCharacters
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:174

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Core/Validation/BillingValidator.php:52:13
     {
         $lastName = $this->trim($lastName);
         if (strlen($lastName) >= 30 || strlen($lastName) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $lastName)) {
+            if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || preg_match('/^[a-zA-Z\\s-]+$/', $lastName)) {
             $errorDTOList[] = new ErrorDTO('Oops, your last name doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidate
statusReason: 1) Core\Validation\BillingValidatorTest::testValidate
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:36

FAILURES!
Tests: 24, Assertions: 45, Failures: 1.

[Killed] LessThanOrEqualToNegotiation
Core/Validation/BillingValidator.php:60:9
     private function validateCity($city, &$errorDTOList): void
     {
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 ||
+        if (strlen($city) >= 20 || strlen($city) > 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $city)) {
             $errorDTOList[] = new ErrorDTO('Oops, your City doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateLastNameExceptionEmpty
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateLastNameExceptionEmpty
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your last name doesn't look right!'
+'Oops, your City doesn't look right!'

[Killed] LogicalOrAllSubExprNegation
Core/Validation/BillingValidator.php:60:9
     private function validateCity($city, &$errorDTOList): void
     {
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $city)) {
+        if (!(strlen($city) >= 20) || !(strlen($city) <= 2) || preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
             $errorDTOList[] = new ErrorDTO('Oops, your City doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateZipExceptionCharacters
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateZipExceptionCharacters
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your Zip-Code doesn't look right!'
+'Oops, your City doesn't look right!'

[Killed] PregMatchRemoveCaret
Core/Validation/BillingValidator.php:61:13
     {
         $city = $this->trim($city);
         if (strlen($city) >= 20 || strlen($city) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $city)) {
+            if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/[a-zA-Z\\s-]+$/', $city)) {
             $errorDTOList[] = new ErrorDTO('Oops, your City doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateCityExceptionCaret
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateCityExceptionCaret
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:397

FAILURES!
Tests: 2, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] PregMatchRemoveDollar
Core/Validation/BillingValidator.php:61:13
     {
         $city = $this->trim($city);
         if (strlen($city) >= 20 || strlen($city) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $city)) {
+            if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+/', $city)) {
             $errorDTOList[] = new ErrorDTO('Oops, your City doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateCityExceptionDollar
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateCityExceptionDollar
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:414

FAILURES!
Tests: 1, Assertions: 1, Failures: 1, Warnings: 1.

[Killed] PregMatchRemoveCaret
Core/Validation/BillingValidator.php:69:9
     private function validateZip($zip, &$errorDTOList): void
     {
         $zip = $this->trim($zip);
-        if (!preg_match('/^\d{4,6}$/', $zip)) {
+        if (!preg_match('/\\d{4,6}$/', $zip)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Zip-Code doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateZipExceptionTooLong
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateZipExceptionTooLong
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:446

FAILURES!
Tests: 12, Assertions: 19, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Core/Validation/BillingValidator.php:69:9
     private function validateZip($zip, &$errorDTOList): void
     {
         $zip = $this->trim($zip);
-        if (!preg_match('/^\d{4,6}$/', $zip)) {
+        if (preg_match('/^\\d{4,6}$/', $zip)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Zip-Code doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooShort1
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooShort1
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your Address doesn't look right!'
+'Oops, your Zip-Code doesn't look right!'

[Killed] GreaterThanOrEqualTo
Core/Validation/BillingValidator.php:77:9
     private function validateAddress($address, &$errorDTOList): void
     {
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 ||
+        if (strlen($address) > 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $address)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $address)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Address doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooLong20
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooLong20
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:531

FAILURES!
Tests: 2, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] LogicalOr
Core/Validation/BillingValidator.php:77:9
     private function validateAddress($address, &$errorDTOList): void
     {
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 ||
+        if (strlen($address) >= 20 && strlen($address) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $address)) {
             !preg_match('/^[a-zA-Z\s-]+$/', $address)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Address doesn\'t look right!');
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooLong
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionTooLong
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:514

FAILURES!
Tests: 33, Assertions: 63, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Core/Validation/BillingValidator.php:78:13
     {
         $address = $this->trim($address);
         if (strlen($address) >= 20 || strlen($address) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $address)) {
+            if (strlen($address) >= 20 || strlen($address) <= 2 || preg_match('/^[a-zA-Z\\s-]+$/', $address)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Address doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionCharacters
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionCharacters
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:548

FAILURES!
Tests: 6, Assertions: 7, Failures: 1, Warnings: 1.

[Killed] PregMatchRemoveCaret
Core/Validation/BillingValidator.php:78:13
     {
         $address = $this->trim($address);
         if (strlen($address) >= 20 || strlen($address) <= 2 ||
-            !preg_match('/^[a-zA-Z\s-]+$/', $address)) {
+            if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/[a-zA-Z\\s-]+$/', $address)) {
             $errorDTOList[] = new ErrorDTO('Oops, your Address doesn\'t look right!');
         }
killedBy: Core\Validation\BillingValidatorTest::testValidateAddressExceptionCaret
statusReason: 1) Core\Validation\BillingValidatorTest::testValidateAddressExceptionCaret
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:582

FAILURES!
Tests: 3, Assertions: 5, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Core/Validation/BillingValidator.php:83:5
         }
     }
 
-    public function trim(string $value): string
+    protected function trim(string $value) : string
     {
         return trim($value);
killedBy: Core\Validation\BillingValidatorTest::testTrimWhiteSpaces
statusReason: 1) Core\Validation\BillingValidatorTest::testTrimWhiteSpaces
Error: Call to protected method App\Core\Validation\BillingValidator::trim() from scope Core\Validation\BillingValidatorTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/BillingValidatorTest.php:616

ERRORS!
Tests: 37, Assertions: 70, Errors: 1.

[Killed] UnwrapTrim
Core/Validation/BillingValidator.php:85:9
 
     public function trim(string $value): string
     {
-        return trim($value);
+        return $value;
     }
 }
killedBy: Core\Validation\BillingValidatorTest::testTrimWhiteSpaces
statusReason: 1) Core\Validation\BillingValidatorTest::testTrimWhiteSpaces
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'leading spaces'
+'    leading spaces'
