[Killed] PublicVisibility
Core/Validation/ClientValidator.php:9:5
 
 class ClientValidator
 {
-    public function validate($userDTO): array
+    protected function validate($userDTO) : array
     {
         $errorDTOList = [];
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidPasswort
Error: Call to protected method App\Core\Validation\ClientValidator::validate() from scope App\Controller\ClientRegistrationController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/ClientRegistrationController.php:40
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControlle

[Killed] MethodCallRemoval
Core/Validation/ClientValidator.php:12:9
     public function validate($userDTO): array
     {
         $errorDTOList = [];
-        $this->validateName($userDTO, $errorDTOList);
+        
         $this->validateEmail($userDTO, $errorDTOList);
         $this->validatePassword($userDTO, $errorDTOList);
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your name doesn't look right'
+'Oops, your email doesn't look right'

[Killed] MethodCallRemoval
Core/Validation/ClientValidator.php:13:9
     {
         $errorDTOList = [];
         $this->validateName($userDTO, $errorDTOList);
-        $this->validateEmail($userDTO, $errorDTOList);
+        
         $this->validatePassword($userDTO, $errorDTOList);
 
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmailAndInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidEmailAndInvalidPasswort
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your email doesn't look right'
+'Oops, your password doesn't look right!'

[Killed] MethodCallRemoval
Core/Validation/ClientValidator.php:14:9
         $errorDTOList = [];
         $this->validateName($userDTO, $errorDTOList);
         $this->validateEmail($userDTO, $errorDTOList);
-        $this->validatePassword($userDTO, $errorDTOList);
+        
 
         return $errorDTOList;
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidPasswort
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidPasswort
Failed asserting that null is identical to 'Oops, your password doesn't look right!'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ClientRegistrationControllerTest.php:122

FAILURES!
Tests: 1, Assertions: 5, Failures: 1, Warnings: 2.

[Killed] PregMatchRemoveDollar
Core/Validation/ClientValidator.php:21:9
 
     private function validateName($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->username) || !preg_match("/^[a-zA-Z-' ]*$/", $clientDTO->username)) {
+        if (empty($clientDTO->username) || !preg_match("/^[a-zA-Z-' ]*/", $clientDTO->username)) {
             $errorDTOList[] = new ErrorDTO('Oops, your name doesn\'t look right');
         }
killedBy: Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
statusReason: 1) Controller\ClientRegistrationControllerTest::testDataConstructInvalidNameAndInvalidEmail
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your name doesn't look right'
+'Oops, your email doesn't look right'

[Killed] LogicalOrAllSubExprNegation
Core/Validation/ClientValidator.php:21:9
 
     private function validateName($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->username) || !preg_match("/^[a-zA-Z-' ]*$/", $clientDTO->username)) {
+        if (!empty($clientDTO->username) || preg_match("/^[a-zA-Z-' ]*\$/", $clientDTO->username)) {
             $errorDTOList[] = new ErrorDTO('Oops, your name doesn\'t look right');
         }
killedBy: Core\Validation\ClientValidatorTest::testValidateExceptionPasswordNoLowerCase
statusReason: 1) Core\Validation\ClientValidatorTest::testValidateExceptionPasswordNoLowerCase
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your password doesn't look right!'
+'Oops, your name doesn't look right'

[Killed] LogicalOr
Core/Validation/ClientValidator.php:28:9
 
     private function validateEmail($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->email) || !filter_var($clientDTO->email, FILTER_VALIDATE_EMAIL)) {
+        if (empty($clientDTO->email) && !filter_var($clientDTO->email, FILTER_VALIDATE_EMAIL)) {
             $errorDTOList[] = new ErrorDTO('Oops, your email doesn\'t look right');
         }
killedBy: Core\Validation\ClientValidatorTest::testValidateExceptionEmail
statusReason: 1) Core\Validation\ClientValidatorTest::testValidateExceptionEmail
Failed asserting that null is an instance of class App\Core\DTO\ErrorDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Validation/ClientValidatorTest.php:137

FAILURES!
Tests: 2, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] LogicalOrNegation
Core/Validation/ClientValidator.php:28:9
 
     private function validateEmail($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->email) || !filter_var($clientDTO->email, FILTER_VALIDATE_EMAIL)) {
+        if (!(empty($clientDTO->email) || !filter_var($clientDTO->email, FILTER_VALIDATE_EMAIL))) {
             $errorDTOList[] = new ErrorDTO('Oops, your email doesn\'t look right');
         }
killedBy: Core\Validation\ClientValidatorTest::testValidateExceptionPasswordEmpty
statusReason: 1) Core\Validation\ClientValidatorTest::testValidateExceptionPasswordEmpty
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Oops, your password doesn't look right!'
+'Oops, your email doesn't look right'
