[Killed] PublicVisibility
Model/BasketRepository.php:29:5
         $this->sqlConnector = new SqlConnector();
         $this->apiCache = new ApiCache($this->apiHandling);
     }
-    public function getBasketInfo() : array
+    protected function getBasketInfo() : array
     {
         $basketIDs = $this->clientRepository->getBasketContent($this->clientRepository->getUserID($this->sessionHandler->getSessionMail()));
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\BasketRepository::getBasketInfo() from scope App\Model\OrderItemProvider

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderItemProvider.php:14
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderEntityManager.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/Homepage

[Killed] Foreach_
Model/BasketRepository.php:34:9
         $basketIDs = $this->clientRepository->getBasketContent($this->clientRepository->getUserID($this->sessionHandler->getSessionMail()));
 
         $itemInfoDTOArray =  [];
-        foreach ($basketIDs as $item){
-            $itemInfoArray = $this->apiCache->getData('item', $item['item_id']);
-            $itemInfoDTOArray [] = $this->apiMapper->MapBasket($itemInfoArray, $this->getItemQuantity($item['item_id']));
-        }
+        foreach (array() as $item) {
         return $itemInfoDTOArray;
     }
killedBy: Core\Basket\BasketManipulatorTest::testAddItemToBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:46

FAILURES!
Tests: 6, Assertions: 13, Failures: 1, Warnings: 1.

[Killed] ArrayOneItem
Model/BasketRepository.php:38:9
             $itemInfoArray = $this->apiCache->getData('item', $item['item_id']);
             $itemInfoDTOArray [] = $this->apiMapper->MapBasket($itemInfoArray, $this->getItemQuantity($item['item_id']));
         }
-        return $itemInfoDTOArray;
+        return count($itemInfoDTOArray) > 1 ? array_slice($itemInfoDTOArray, 0, 1, true) : $itemInfoDTOArray;
     }
     public function getItemQuantity($itemID) : array
killedBy: Model\BasketRepositoryTest::testGetBasketInfoMultipleItems
statusReason: 1) Model\BasketRepositoryTest::testGetBasketInfoMultipleItems
Failed asserting that null is identical to 'Gregor Kobel Trikot'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/BasketRepositoryTest.php:62

FAILURES!
Tests: 20, Assertions: 70, Failures: 1, Warnings: 2.

[Killed] PublicVisibility
Model/BasketRepository.php:40:5
         }
         return $itemInfoDTOArray;
     }
-    public function getItemQuantity($itemID) : array
+    protected function getItemQuantity($itemID) : array
     {
         $userID = $this->clientRepository->getUserID($this->sessionHandler->getSessionMail());
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\BasketRepository::getItemQuantity() from scope App\Model\ClientEntityManager

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientEntityManager.php:37
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:61

2) Controller\OrderOverviewControllerTest::testData

[Killed] PublicVisibility
Model/BasketRepository.php:46:5
     }
 
-    public function getBasketTotal() : ?string
+    protected function getBasketTotal() : ?string
     {
         $array = $this->getBasketInfo();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Model\BasketRepository::getBasketTotal() from scope App\Controller\CheckoutController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:33
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:45

2) Core\TotalCalculatorTest::testCalculateTo

[Killed] DecrementInteger
Model/BasketRepository.php:49:9
     public function getBasketTotal() : ?string
     {
         $array = $this->getBasketInfo();
-        $price = 0;
+        $price = -1;
         foreach ($array as $item)
         {
killedBy: Core\TotalCalculatorTest::testCalculateTotalValid
statusReason: 1) Core\TotalCalculatorTest::testCalculateTotalValid
Failed asserting that 3.95 is identical to 4.95.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/TotalCalculatorTest.php:57

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Foreach_
Model/BasketRepository.php:50:9
     {
         $array = $this->getBasketInfo();
         $price = 0;
-        foreach ($array as $item)
-        {
-            if($item->quantity >= 2){
-                $item->price *= $item->quantity;
-            }
-            $price = $item->price;
-        }
+        foreach (array() as $item) {
         return $price ?? null;
     }
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'0'

[Killed] GreaterThanOrEqualToNegotiation
Model/BasketRepository.php:52:13
         $price = 0;
         foreach ($array as $item)
         {
-            if($item->quantity >= 2){
+            if ($item->quantity < 2) {
                 $item->price *= $item->quantity;
             }
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'29.99'

[Killed] GreaterThanOrEqualTo
Model/BasketRepository.php:52:13
         $price = 0;
         foreach ($array as $item)
         {
-            if($item->quantity >= 2){
+            if ($item->quantity > 2) {
                 $item->price *= $item->quantity;
             }
killedBy: Model\BasketRepositoryTest::testGetBasketTotalQuantity
statusReason: 1) Model\BasketRepositoryTest::testGetBasketTotalQuantity
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'59.98'
+'29.99'

[Killed] MulEqual
Model/BasketRepository.php:53:17
         foreach ($array as $item)
         {
             if($item->quantity >= 2){
-                $item->price *= $item->quantity;
+                $item->price /= $item->quantity;
             }
             $price = $item->price;
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'5.998'

[Killed] Assignment
Model/BasketRepository.php:53:17
         foreach ($array as $item)
         {
             if($item->quantity >= 2){
-                $item->price *= $item->quantity;
+                $item->price = $item->quantity;
             }
             $price = $item->price;
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'5'
