[Killed] PublicVisibility
Model/ClientEntityManager.php:22:5
         $this->basketRepository = new BasketRepository();
     }
 
-    public function saveCredentials(ClientDTO $newUser): string
+    protected function saveCredentials(ClientDTO $newUser) : string
     {
         $query = "INSERT INTO users (username, email, password) VALUES (:username, :email, :password)";
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientEntityManager::saveCredentials() from scope Controller\CheckoutControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:36

2) Controller\BasketControllerTest::testDataConstructAdd
Error: Call to protected method App\Model\ClientEntityManager::saveC

[Killed] ArrayItemRemoval
Model/ClientEntityManager.php:26:9
     {
         $query = "INSERT INTO users (username, email, password) VALUES (:username, :email, :password)";
 
-        $params = [
-            'username' => $newUser->username,
-            'email' => $newUser->email,
-            'password' => $newUser->password
-        ];
+        $params = ['email' => $newUser->email, 'password' => $newUser->password];
 
         return $this->sqlConnector->executeInsertQuery($query, $params);
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
PDOException: SQLSTATE[HY093]: Invalid parameter number: number of bound variables does not match number of tokens

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:58
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientEntityManager.php:24
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutC

[Killed] PublicVisibility
Model/ClientEntityManager.php:35:5
         return $this->sqlConnector->executeInsertQuery($query, $params);
     }
 
-    public function addToBasket($itemID, $userID): string
+    protected function addToBasket($itemID, $userID) : string
     {
         if (empty($this->basketRepository->getItemQuantity($itemID))) {
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientEntityManager::addToBasket() from scope Controller\HomepageControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:61

2) Controller\OrderOverviewControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientEntityManager::addTo

[Killed] ArrayItemRemoval
Model/ClientEntityManager.php:40:13
         if (empty($this->basketRepository->getItemQuantity($itemID))) {
             $query = "INSERT INTO user_baskets (item_id, user_id) VALUES (:item_id, :user_id)";
 
-            $params = [
-                ':item_id' => $itemID,
-                ':user_id' => $userID,
-            ];
+            $params = [':user_id' => $userID];
             return $this->sqlConnector->executeInsertQuery($query, $params);
         }
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
PDOException: SQLSTATE[HY093]: Invalid parameter number: number of bound variables does not match number of tokens

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:58
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/ClientEntityManager.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageC

[Killed] PublicVisibility
Model/ClientEntityManager.php:49:5
         return $this->increaseQuantity($itemID, $userID);
     }
 
-    public function removeFromBasket($itemID, $userID): string
+    protected function removeFromBasket($itemID, $userID) : string
     {
         if (empty($this->basketRepository->getItemQuantity($itemID)) || $this->basketRepository->getItemQuantity($itemID) === [0 => ['quantity' => '1']]) {
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Error: Call to protected method App\Model\ClientEntityManager::removeFromBasket() from scope App\Core\Basket\BasketManipulator

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/Basket/BasketManipulator.php:37
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:56

2) Controller\BasketControllerTe

[Killed] DecrementInteger
Model/ClientEntityManager.php:51:9
 
     public function removeFromBasket($itemID, $userID): string
     {
-        if (empty($this->basketRepository->getItemQuantity($itemID)) || $this->basketRepository->getItemQuantity($itemID) === [0 => ['quantity' => '1']]) {
+        if (empty($this->basketRepository->getItemQuantity($itemID)) || $this->basketRepository->getItemQuantity($itemID) === [-1 => ['quantity' => '1']]) {
             $query = "DELETE FROM user_baskets WHERE item_id = :item_id AND user_id = :user_id";
 
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:60

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] IncrementInteger
Model/ClientEntityManager.php:51:9
 
     public function removeFromBasket($itemID, $userID): string
     {
-        if (empty($this->basketRepository->getItemQuantity($itemID)) || $this->basketRepository->getItemQuantity($itemID) === [0 => ['quantity' => '1']]) {
+        if (empty($this->basketRepository->getItemQuantity($itemID)) || $this->basketRepository->getItemQuantity($itemID) === [1 => ['quantity' => '1']]) {
             $query = "DELETE FROM user_baskets WHERE item_id = :item_id AND user_id = :user_id";
 
killedBy: Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testRemoveItemFromBasket
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:60

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] IncrementInteger
Model/ClientEntityManager.php:69:9
         $query = "UPDATE user_baskets SET quantity = :quantity WHERE user_id = :user_id AND item_id = :item_id";
 
         $arrayWithQuantity = $this->basketRepository->getItemQuantity($itemID);
-        $quantity = $arrayWithQuantity[0]['quantity'] + 1;
+        $quantity = $arrayWithQuantity[0]['quantity'] + 2;
 
         $params = [
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'269.91'

[Killed] IncrementInteger
Model/ClientEntityManager.php:69:9
         $query = "UPDATE user_baskets SET quantity = :quantity WHERE user_id = :user_id AND item_id = :item_id";
 
         $arrayWithQuantity = $this->basketRepository->getItemQuantity($itemID);
-        $quantity = $arrayWithQuantity[0]['quantity'] + 1;
+        $quantity = $arrayWithQuantity[1]['quantity'] + 1;
 
         $params = [
killedBy: Controller\BasketControllerTest::testDataConstructAdd
statusReason: 1) Controller\BasketControllerTest::testDataConstructAdd
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'149.95'
+'29.99'

[Killed] IncrementInteger
Model/ClientEntityManager.php:86:9
 
         $arrayWithQuantity = $this->basketRepository->getItemQuantity($itemID);
 
-        $quantity = $arrayWithQuantity[0]['quantity'] - 1;
+        $quantity = $arrayWithQuantity[1]['quantity'] - 1;
 
         $params = [
killedBy: Model\ClientEntityManagerTest::testDecreaseQuantityOnce
statusReason: 1) Model\ClientEntityManagerTest::testDecreaseQuantityOnce
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'1'
+'-1'

[Killed] Minus
Model/ClientEntityManager.php:86:9
 
         $arrayWithQuantity = $this->basketRepository->getItemQuantity($itemID);
 
-        $quantity = $arrayWithQuantity[0]['quantity'] - 1;
+        $quantity = $arrayWithQuantity[0]['quantity'] + 1;
 
         $params = [
killedBy: Model\ClientEntityManagerTest::testDecreaseQuantityOnce
statusReason: 1) Model\ClientEntityManagerTest::testDecreaseQuantityOnce
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'1'
+'3'

[Killed] PublicVisibility
Model/ClientEntityManager.php:97:5
         return $this->sqlConnector->executeInsertQuery($query, $params);
     }
 
-    public function emptyBasket(): string
+    protected function emptyBasket() : string
     {
         $userID = $this->clientRepository->getUserID($_SESSION['mail']);
killedBy: Controller\ThankYouControllerTest::testDataConstruct
statusReason: 1) Controller\ThankYouControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientEntityManager::emptyBasket() from scope App\Controller\ThankYouController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/ThankYouController.php:35
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/ThankYouControllerTest.php:72

2) Model\ClientEntityManagerTest::testEmptyB
