[Killed] PublicVisibility
Model/ClientRepository.php:18:5
         $this->clientMapper = new ClientMapper();
         $this->sqlConnector = new \App\Core\SQL\SqlConnector();
     }
-    public function findByMail(string $mail): ?ClientDTO
+    protected function findByMail(string $mail) : ?ClientDTO
     {
         $array = $this->sqlConnector->executeSelectQuery("SELECT * FROM users where email = :mail", [':mail' => $mail]);
killedBy: Model\ClientRepositoryTest::testFindByMail
statusReason: 1) Model\ClientRepositoryTest::testFindByMail
Error: Call to protected method App\Model\ClientRepository::findByMail() from scope Model\ClientRepositoryTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:39

2) Model\ClientEntityManagerTest::testSaveCredentials
Error: Call to protected method App\Model\ClientRepository::findByMail() from scope Model\ClientEntityM

[Killed] ArrayItemRemoval
Model/ClientRepository.php:20:9
     }
     public function findByMail(string $mail): ?ClientDTO
     {
-        $array = $this->sqlConnector->executeSelectQuery("SELECT * FROM users where email = :mail", [':mail' => $mail]);
+        $array = $this->sqlConnector->executeSelectQuery("SELECT * FROM users where email = :mail", []);
         return $this->clientMapper->mapFromArray2Dto($array);
     }
killedBy: Model\ClientRepositoryTest::testFindByMail
statusReason: 1) Model\ClientRepositoryTest::testFindByMail
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ':mail' at line 1

/home/nicogruenewald/Documents/BuyMyTrikots/src/Core/SQL/SqlConnector.php:44
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/

[Killed] PublicVisibility
Model/ClientRepository.php:24:5
         return $this->clientMapper->mapFromArray2Dto($array);
     }
 
-    public function checkLoginCredentials(ClientDTO $clientDTO): bool
+    protected function checkLoginCredentials(ClientDTO $clientDTO) : bool
     {
         $userDTO = $this->findByMail($clientDTO->email);
killedBy: Model\ClientRepositoryTest::testCheckLoginCredentials
statusReason: 1) Model\ClientRepositoryTest::testCheckLoginCredentials
Error: Call to protected method App\Model\ClientRepository::checkLoginCredentials() from scope Model\ClientRepositoryTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:56

2) Model\ClientRepositoryTest::testCheckLoginCredentialsInvalid
Error: Call to protected method App\Model\ClientRepository::checkLoginC

[Killed] LogicalAndSingleSubExprNegation
Model/ClientRepository.php:27:9
     public function checkLoginCredentials(ClientDTO $clientDTO): bool
     {
         $userDTO = $this->findByMail($clientDTO->email);
-        if ($userDTO instanceof ClientDTO && password_verify($clientDTO->password, $userDTO->password)) {
+        if ($userDTO instanceof ClientDTO && !password_verify($clientDTO->password, $userDTO->password)) {
             return true;
         }
killedBy: Model\ClientRepositoryTest::testCheckLoginCredentials
statusReason: 1) Model\ClientRepositoryTest::testCheckLoginCredentials
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:58

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Killed] LogicalAndNegation
Model/ClientRepository.php:27:9
     public function checkLoginCredentials(ClientDTO $clientDTO): bool
     {
         $userDTO = $this->findByMail($clientDTO->email);
-        if ($userDTO instanceof ClientDTO && password_verify($clientDTO->password, $userDTO->password)) {
+        if (!($userDTO instanceof ClientDTO && password_verify($clientDTO->password, $userDTO->password))) {
             return true;
         }
killedBy: Model\ClientRepositoryTest::testCheckLoginCredentialsInvalid
statusReason: 1) Model\ClientRepositoryTest::testCheckLoginCredentialsInvalid
Failed asserting that true is false.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:71

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Killed] TrueValue
Model/ClientRepository.php:28:13
     {
         $userDTO = $this->findByMail($clientDTO->email);
         if ($userDTO instanceof ClientDTO && password_verify($clientDTO->password, $userDTO->password)) {
-            return true;
+            return false;
         }
         return false;
killedBy: Model\ClientRepositoryTest::testCheckLoginCredentials
statusReason: 1) Model\ClientRepositoryTest::testCheckLoginCredentials
Failed asserting that false is true.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/ClientRepositoryTest.php:58

FAILURES!
Tests: 6, Assertions: 10, Failures: 1.

[Killed] PublicVisibility
Model/ClientRepository.php:33:5
         return false;
     }
 
-    public function getBasketContent($userID) : array
+    protected function getBasketContent($userID) : array
     {
         return $this->sqlConnector->executeSelectQuery("SELECT user_baskets.item_id FROM user_baskets where user_baskets.user_id = :user_id", [':user_id' => $userID]);
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientRepository::getBasketContent() from scope App\Model\BasketRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderItemProvider.php:14
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderEntityMana

[Killed] PublicVisibility
Model/ClientRepository.php:38:5
         return $this->sqlConnector->executeSelectQuery("SELECT user_baskets.item_id FROM user_baskets where user_baskets.user_id = :user_id", [':user_id' => $userID]);
     }
 
-    public function getUserID(string $mail) : ?int
+    protected function getUserID(string $mail) : ?int
     {
         $rawIdArray =  $this->sqlConnector->executeSelectQuery("SELECT users.id FROM users where users.email = :mail", [":mail" => $mail]);
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\ClientRepository::getUserID() from scope App\Model\BasketRepository

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/BasketRepository.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderItemProvider.php:14
/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderEntityManager.php

[Killed] Foreach_
Model/ClientRepository.php:42:9
     {
         $rawIdArray =  $this->sqlConnector->executeSelectQuery("SELECT users.id FROM users where users.email = :mail", [":mail" => $mail]);
 
-        foreach ($rawIdArray as $entry){
-            $formattedId = $entry['id'];
-        }
+        foreach (array() as $entry) {
         return $formattedId ?? null;
     }
killedBy: Core\Basket\BasketManipulatorTest::testAddItemToBasket
statusReason: 1) Core\Basket\BasketManipulatorTest::testAddItemToBasket
Failed asserting that null is an instance of class App\Core\DTO\BasketDTO.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Core/Basket/BasketManipulatorTest.php:46

FAILURES!
Tests: 6, Assertions: 13, Failures: 1, Warnings: 1.
