[Killed] PublicVisibility
Model/OrderEntityManager.php:27:5
     /**
      * @throws JsonException
      */
-    public function saveOrder(OrderDTO $orderDTO) : string
+    protected function saveOrder(OrderDTO $orderDTO) : string
     {
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\OrderEntityManager::saveOrder() from scope Controller\HomepageControllerTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:59

2) Controller\OrderOverviewControllerTest::testDataConstruct
Error: Call to protected method App\Model\OrderEntityManager::saveOrder
