[Killed] PublicVisibility
Model/OrderItemProvider.php:12:5
     {
         $this->basketRepository = new BasketRepository();
     }
-    public function getItems() : array
+    protected function getItems() : array
     {
         $basket = $this->basketRepository->getBasketInfo();
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\OrderItemProvider::getItems() from scope App\Model\OrderEntityManager

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderEntityManager.php:31
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:59

2) Controller\OrderOverviewControllerTest::testDataConstruc

[Killed] Foreach_
Model/OrderItemProvider.php:17:9
         $basket = $this->basketRepository->getBasketInfo();
 
         $items = [];
-        foreach ($basket as $item) {
-            $items = [
-                'id'       => $item->id,
-                'quantity' => $item->quantity,
-            ];
-        }
+        foreach (array() as $item) {
         return  $items;
     }
killedBy: Model\OrderEntityManagerTest::testSaveOrderValid
statusReason: 1) Model\OrderEntityManagerTest::testSaveOrderValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"id": "44", "quantity": "1"}'
+'[]'

[Killed] ArrayItemRemoval
Model/OrderItemProvider.php:18:13
 
         $items = [];
         foreach ($basket as $item) {
-            $items = [
-                'id'       => $item->id,
-                'quantity' => $item->quantity,
-            ];
+            $items = ['quantity' => $item->quantity];
         }
         return  $items;
killedBy: Model\OrderItemProviderTest::testGetItemsHigherQuantity
statusReason: 1) Model\OrderItemProviderTest::testGetItemsHigherQuantity
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
-    'id' => '44',
     'quantity' => '4',

[Killed] ArrayItem
Model/OrderItemProvider.php:19:17
         $items = [];
         foreach ($basket as $item) {
             $items = [
-                'id'       => $item->id,
+                $items = ['id' > $item->id, 'quantity' => $item->quantity];
                 'quantity' => $item->quantity,
             ];
killedBy: Model\OrderEntityManagerTest::testSaveOrderValid
statusReason: 1) Model\OrderEntityManagerTest::testSaveOrderValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"id": "44", "quantity": "1"}'
+'{"0": true, "quantity": "1"}'

[Killed] ArrayOneItem
Model/OrderItemProvider.php:23:9
                 'quantity' => $item->quantity,
             ];
         }
-        return  $items;
+        return count($items) > 1 ? array_slice($items, 0, 1, true) : $items;
     }
 }
killedBy: Model\OrderEntityManagerTest::testSaveOrderValid
statusReason: 1) Model\OrderEntityManagerTest::testSaveOrderValid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"id": "44", "quantity": "1"}'
+'{"id": "44"}'
