[Killed] PublicVisibility
Model/OrderRepository.php:28:5
         $this->sessionHandler = new SessionHandler();
     }
 
-    public function getOrderInformation(): OrderDTO
+    protected function getOrderInformation() : OrderDTO
     {
         $dataKeys = ["first_name", "last_name", "address", "city", "zip", "payment", "delivery"];
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Error: Call to protected method App\Model\OrderRepository::getOrderInformation() from scope App\Controller\CheckoutController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/CheckoutController.php:29
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:45

2) Controller\OrderOverviewControllerTes

[Killed] MethodCallRemoval
Model/OrderRepository.php:32:9
     {
         $dataKeys = ["first_name", "last_name", "address", "city", "zip", "payment", "delivery"];
 
-        $this->sessionHandler->setOrderSession($dataKeys);
+        
 
         $billingArray = $this->sessionHandler->getOrderSession();
killedBy: Model\OrderRepositoryTest::testGetOrderInformationDHL
statusReason: 1) Model\OrderRepositoryTest::testGetOrderInformationDHL
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'4.95'
+'0'

[Killed] PublicVisibility
Model/OrderRepository.php:40:5
 
         return $this->billingMapper->mapBilling($billingArray);
     }
-    public function getOrderId() : int
+    protected function getOrderId() : int
     {
         $query = "SELECT orders.id FROM orders WHERE orders.user_id = :user_id ORDER BY orders.id DESC LIMIT 1";
killedBy: Model\OrderRepositoryTest::testGetOrderId
statusReason: 1) Model\OrderRepositoryTest::testGetOrderId
Error: Call to protected method App\Model\OrderRepository::getOrderId() from scope Model\OrderRepositoryTest

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/OrderRepositoryTest.php:131

2) Controller\ThankYouControllerTest::testDataConstruct
Error: Call to protected method App\Model\OrderRepository::getOrderId() from scope App\Controller\ThankY

[Killed] IncrementInteger
Model/OrderRepository.php:52:9
 
         $array = $this->sqlConnector->executeSelectQuery($query, $params);
 
-        return $array[0]['id'];
+        return $array[1]['id'];
     }
 }
killedBy: Model\OrderRepositoryTest::testGetOrderId
statusReason: 1) Model\OrderRepositoryTest::testGetOrderId
TypeError: App\Model\OrderRepository::getOrderId(): Return value must be of type int, null returned

/home/nicogruenewald/Documents/BuyMyTrikots/src/Model/OrderRepository.php:39
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Model/OrderRepositoryTest.php:131

2) Controller\ThankYouControllerTest::testDataConstruct
TypeError: App\Model\OrderRepository
