[Killed] PublicVisibility
Model/PlayerRepository.php:25:5
     /**
      * @return PlayerDTO[]
      */
-    public function getPlayers($teamID) : array
+    protected function getPlayers($teamID) : array
     {
         $rawPlayerArray = $this->apiCache->getData('players', $teamID);
killedBy: Controller\HomepageControllerTest::testDataConstruct
statusReason: 1) Controller\HomepageControllerTest::testDataConstruct
Error: Call to protected method App\Model\PlayerRepository::getPlayers() from scope App\Controller\HomepageController

/home/nicogruenewald/Documents/BuyMyTrikots/src/Controller/HomepageController.php:33
/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/HomepageControllerTest.php:77

2) Model\PlayerRepositoryTest::testGetPlayers
Er
