[Killed] LogicalAndNegation
Controller/BasketController.php:38:9
             'remove' => 'removeItemFromBasket'
         ];
 
-        if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
+        if (!(!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap))) {
             $this->feedback = 'successful action';
             $this->manipulator->{$actionMap[$action]}();
killedBy: Controller\BasketControllerTest::testDataConstructNegative
statusReason: 1) Controller\BasketControllerTest::testDataConstructNegative
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-''
+'successful action'

[Killed] MethodCallRemoval
Controller/BasketController.php:40:13
 
         if (!empty($this->sessionHandler->getSessionMail()) && array_key_exists($action, $actionMap)) {
             $this->feedback = 'successful action';
-            $this->manipulator->{$actionMap[$action]}();
+            
         }
 
killedBy: Controller\BasketControllerTest::testDataConstructRemove
statusReason: 1) Controller\BasketControllerTest::testDataConstructRemove
Failed asserting that an array is empty.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/BasketControllerTest.php:83

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
