[Killed] MethodCallRemoval
Controller/CheckoutController.php:31:9
     public function dataConstruct(): TemplateEngine
     {
         $this->errorDTOList = $this->billingValidator->validate($this->orderRepository->getOrderInformation());
-        $this->billingValidator->redirectIfValid($this->errorDTOList);
+        
 
         $basket = $this->basketRepository->getBasketInfo();
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?page=order-overview'
+''

[Killed] MethodCallRemoval
Controller/CheckoutController.php:38:9
         $values = $this->orderRepository->getOrderInformation();
 
         $this->templateEngine->setTemplate('checkout.twig');
-        $this->templateEngine->addParameter('errors', $this->errorDTOList);
+        
         $this->templateEngine->addParameter('values', $values);
         $this->templateEngine->addParameter('basket', $basket);
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Failed asserting that null is of type array.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:61

FAILURES!
Tests: 1, Assertions: 3, Failures: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controller/CheckoutController.php:39:9
 
         $this->templateEngine->setTemplate('checkout.twig');
         $this->templateEngine->addParameter('errors', $this->errorDTOList);
-        $this->templateEngine->addParameter('values', $values);
+        
         $this->templateEngine->addParameter('basket', $basket);
         $this->templateEngine->addParameter('total', $total);
killedBy: Controller\CheckoutControllerTest::testDataConstruct
statusReason: 1) Controller\CheckoutControllerTest::testDataConstruct
Failed asserting that null is identical to 'TEST@TEST.com'.

/home/nicogruenewald/Documents/BuyMyTrikots/tests/Controller/CheckoutControllerTest.php:62

FAILURES!
Tests: 1, Assertions: 4, Failures: 1, Warnings: 2.
